open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_aton_aie.c
/****************************************************************************
 * arch/arm/src/stm32n6/stm32n6_aton_aie.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* STM32N6 Neural-ART NPU AI Engine lower-half driver.
 *
 * This driver wraps the ST Neural-ART NPU (accessed through the ST ATON
 * runtime) behind the generic NuttX AI Engine upper-half interface
 * (drivers/aie/ai_engine.c).  It follows the same lower-half pattern as
 * the Arm Ethos-U driver (drivers/aie/ethosu/ethosu_lowerhalf.c).
 *
 * Hardware notes (secure world, NuttX runs in the secure domain):
 *   - NPU register base : 0x580E0000  (STM32_NPU_BASE, AHB5 + 0x0C0000)
 *   - NPU cache RAM      : 0x343C0000  (STM32_NPU_CACHEAXIRAM_BASE, 256 KB)
 *   - Interrupts         : STM32_IRQ_NPU0..NPU3 (NVIC 53..56)
 *   - RCC                : AHB5ENR.NPUEN (bit 31) / AHB5RSTR.NPURST (bit 31)
 *
 * The ATON runtime itself is NOT linked yet (the compiled-in model is not
 * available until the model-training stage completes).  The aie_ops
 * callbacks therefore only perform the hardware bring-up and leave the
 * actual stai_* runtime calls as clearly marked TODO stubs.
 */

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <errno.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/clock.h>
#include <nuttx/kthread.h>
#include <nuttx/sched.h>
#include <nuttx/signal.h>
#include <nuttx/irq.h>
#include <nuttx/kmalloc.h>
#include <nuttx/mutex.h>
#include <nuttx/nuttx.h>

#include <nuttx/aie/ai_engine.h>
#include <nuttx/aie/stm32n6_aton_aie.h>

#ifdef CONFIG_LIB_AI_ATON
#  include <string.h>
#  include <stai.h>
#  include "npu_cache.h"   /* NuttX CACHEAXI glue (libs/ai_aton/nuttx) */
#  include "aton_model.h"  /* model binding (libs/ai_aton/nuttx) */
#endif

#include "arm_internal.h"
#include "stm32n6_cacheaxi.h"
#include "hardware/stm32_aton.h"
#include "hardware/stm32_cacheaxi.h"
#include "hardware/stm32_rcc.h"
#include "hardware/stm32_memorymap.h"

/* RIFSC RIMC helpers (STM32_RIFSC_RIMC_ATTR, RIFSC_RIMC_ATTR_MCID/MSEC/MPRIV)
 * currently live in the DMA2D header -- the same include the FSBL regression
 * probe uses for its RIMC_ATTR read-back.
 */

#include "hardware/stm32_dma2d.h"

/* NOTE: this file deliberately stays on the image-wide -Os.
 *
 * It briefly carried a "#pragma GCC optimize (\"O0\")" to match the r62 build
 * (no optimisation anywhere), but that trapped at boot: the compiler emitted
 * "udf #255" - its trap for an unreachable path - inside
 * stm32n6_aton_ns_setup() and the CPU jumped straight into it.  GCC's own
 * documentation says the optimize attribute/pragma is for debugging only and
 * not for production code, which is exactly what a mixed -Os/-O0 translation
 * unit does here.  The -O0 pin that actually matters - the ll_aton runtime,
 * the OSAL/cache glue and the generated network - lives in libs/ai_aton and
 * is applied there with a plain target_compile_options().
 */

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#ifndef CONFIG_STM32N6_ATON_AIE_DEVPATH
#  define CONFIG_STM32N6_ATON_AIE_DEVPATH "/dev/aie0"
#endif

/* RISAF instances guarding the RAM/LCD/XSPI address spaces, and the
 * illegal-access registers used for post-mortem diagnosis: if the NPU (CID1)
 * is not allowed to reach the tensor pool or the NOR holding the model
 * initializers, the fault is recorded here (IASR, write 1 to clear via IACR).
 */

#define STM32N6_ATON_RISAF1_BASE   (STM32_AHB3_BASE + 0x6000)
#define STM32N6_ATON_RISAF2_BASE   (STM32_AHB3_BASE + 0x7000)
#define STM32N6_ATON_RISAF3_BASE   (STM32_AHB3_BASE + 0x8000)
#define STM32N6_ATON_RISAF4_BASE   (STM32_AHB3_BASE + 0x9000)
#define STM32N6_ATON_RISAF5_BASE   (STM32_AHB3_BASE + 0xa000)
#define STM32N6_ATON_RISAF6_BASE   (STM32_AHB3_BASE + 0xb000)
#define STM32N6_ATON_RISAF7_BASE   (STM32_AHB3_BASE + 0xc000)
#define STM32N6_ATON_RISAF8_BASE   (STM32_AHB3_BASE + 0xd000)
#define STM32N6_ATON_RISAF9_BASE   (STM32_AHB3_BASE + 0xe000)
#define STM32N6_ATON_RISAF11_BASE  (STM32_AHB3_BASE + 0x10000) /* XSPI1 */
#define STM32N6_ATON_RISAF12_BASE  (STM32_AHB3_BASE + 0x11000) /* XSPI2 */
#define STM32N6_ATON_RISAF13_BASE  (STM32_AHB3_BASE + 0x12000) /* XSPI3 */
#define STM32N6_ATON_RISAF_CR      0x00
#define STM32N6_ATON_RISAF_IASR    0x08
#define STM32N6_ATON_RISAF_IACR    0x0c

/* RISAF instance map (RM0486 Table 24):
 *
 *   RISAF1  TCMs           RISAF2  CPU AXI RAM0    RISAF3  CPU AXI RAM1
 *   RISAF4  NPU master 0   RISAF5  NPU master 1    RISAF6  CPU master
 *   RISAF7  FLEXMEM        RISAF8  CACHEAXI        RISAF9  VENCRAM
 *   RISAF11 XSPI1          RISAF12 XSPI2 (NOR)     RISAF13 XSPI3
 *
 * RISAF11..13 decide whether the NPU may read the 4 MB of model initializers
 * that live in the xSPI2 NOR window: an address no enabled base region covers
 * falls back to the primary-region rule, fixed to "secure, privileged and
 * CID = 1 only" (RM0486 7.4.4), so a non-secure master reads zeros there.
 *
 * NOTE: an earlier revision claimed RISAF11..14 fault on access.  That was a
 * bug in this driver's probe loop (the instance table had grown to 13 entries
 * while the initializer still had 9, so the loop dereferenced a NULL entry).
 */

#define STM32N6_ATON_NRISAF        12
#define STM32N6_ATON_NXSPI         3

