open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_aton_aie.c
/* Provided by the board linker script (flash.ld): the non-secure blob window
 * that the .nsblob section is placed in.
 */

extern uint8_t _snsblob[];
extern uint8_t _ensblob[];

/* The ATON OSAL lives in libs/ai_aton.  Only the init entry point is called
 * from this file (the runtime's load-time cache hooks need the mutexes to
 * exist before the first blob is touched), so declare it here instead of
 * pulling in the whole OSAL macro header.
 */

void aton_osal_nuttx_init(void);

/* Helpers defined further down that the boot-time probes already use: a real
 * non-secure read (temporarily re-programming an SAU region) and the one-line
 * RISAF latch summary.
 */

static uint32_t stm32n6_aton_ns_read32(int region, uint32_t addr);
static void stm32n6_aton_latch_report(void);

/* SAU registers (ARMv8-M core private region).  Programmed directly: the
 * ARMv8-M port has the helpers in arm_sau.c, but that file is not part of
 * this build.
 */

#define STM32N6_ATON_SAU_CTRL  0xe000edd0
#define STM32N6_ATON_SAU_RNR   0xe000edd8
#define STM32N6_ATON_SAU_RBAR  0xe000eddc
#define STM32N6_ATON_SAU_RLAR  0xe000ede0

/* Value of aton_osal_nuttx_stage() while the ATON runtime sits in its
 * wait-for-NPU loop (ATON_STAGE_WFE on the OSAL side).
 */

#define STM32N6_ATON_STAGE_WFE  5

/* Consecutive watchdog samples with an unchanged BC before the intrusive
 * diagnostic dump is taken: one sample is a healthy wait-for-event, several
 * are a stalled epoch controller.
 */

#define STM32N6_ATON_STALL_SAMPLES  3

/* Program one SAU region as non-secure.  RBAR holds the base, RLAR the
 * inclusive limit with bit 0 as the region enable; both work on a 32 byte
 * granularity, so the low five bits are dropped.
 */

static void stm32n6_aton_sau_ns_region(int region, uint32_t base, uint32_t size)
{
  putreg32((uint32_t)region, STM32N6_ATON_SAU_RNR);
  putreg32(base & 0xffffffe0, STM32N6_ATON_SAU_RBAR);
  putreg32(((base + size - 1) & 0xffffffe0) | 0x1, STM32N6_ATON_SAU_RLAR);
}

/* RISAF illegal-access entry: IAESR (attributes of the rejected master) and
 * IADDR (full 32-bit address of the rejected access).  IASR only carries the
 * flags, so the address must be read here and not reconstructed from IASR.
 */

#define STM32N6_ATON_RISAF_IAESR   0x20
#define STM32N6_ATON_RISAF_IADDR   0x24

/* Region n occupies 0x30 bytes at 0x40 + 0x30 * n.  Field order inside a
 * region block is CFGR, STARTR, ENDR, CIDCFGR (STM32N647xx CMSIS
 * RISAF_Region_TypeDef) - note that CFGR comes first, not last.
 */

#define STM32N6_ATON_RISAF_REG0    0x40

/* Region attribute words.  Bit 0 is BREN (base region enable), bit 8 is SEC
 * ("this region is for secure masters"), bits 16..23 are PRIVC0..7 (the CID
 * mask of masters that are allowed in with privilege).
 *
 *   ..._CFGR_SEC_OPEN: BREN | SEC | every CID privileged (the word the board
 *                      FSBL uses for the RAM windows it opens)
 *   ..._CFGR_NS_OPEN:  BREN |      | every CID privileged, non-secure region
 */

#define STM32N6_ATON_RISAF_CFGR_SEC_OPEN 0x00ff0101
#define STM32N6_ATON_RISAF_CFGR_NS_OPEN  0x00ff0001

/* One region block is 16 words long (CFGR, STARTR, ENDR, CIDCFGR, the A and B
 * sub-region registers and four reserved words), so region n sits at
 * REG0 + 0x40 * n.
 */

#define STM32N6_ATON_RISAF_REGION_STRIDE 0x40

/* Subregion A of a base region (RM0486 7.5.10..7.5.13).  Table 26 allows a
 * secure privileged base region to carry a non-secure subregion, which is the
 * only way one address range can serve both security domains - and the NOR
 * weights need exactly that (see the domain sweep below).
 */

#define STM32N6_ATON_RISAF_REG_ACFGR   0x50
#define STM32N6_ATON_RISAF_REG_ASTARTR 0x54
#define STM32N6_ATON_RISAF_REG_AENDR   0x58
#define STM32N6_ATON_RISAF_REG_ANESTR  0x5c

#define STM32N6_ATON_RISAF_SR_SREN     (1u << 0)
#define STM32N6_ATON_RISAF_SR_SEC      (1u << 8)
#define STM32N6_ATON_RISAF_SR_PRIV     (1u << 9)
#define STM32N6_ATON_RISAF_SR_RDEN     (1u << 12)
#define STM32N6_ATON_RISAF_SR_WREN     (1u << 13)

/* Non-secure alias windows.
 *
 * STM32N6 maps its internal RAMs twice: at 0x3400_0000.. ("secure alias") and
 * at 0x2400_0000.. ("non-secure alias"), the difference between the two being
 * 0x1000_0000.  The NPU is a non-secure master - the RISAF records its
 * transactions as "ns" no matter what the RIMC says about it - so every
 * buffer it touches has to sit in a RISAF region that is configured
 * non-secure, and the CPU can only reach such a region through the non-secure
 * alias (a secure access is not accepted by a non-secure region, which is why
 * the FSBL had to keep its windows secure).
 *
 * Using the alias is therefore what lets both sides share a buffer: the CPU
 * writes through 0x24xx_xxxx (non-secure transaction) and the NPU reads the
 * very same words.
 *
 *   0x2410_0000  SRAM2 alias : .nsblob (epoch program buffers) + user I/O tensors
 *   0x2420_0000  SRAM3..6 alias : NPU tensor pool (model pools 0..3 and 7)
 *   0x243C_0000  NPU cache RAM alias
 */

#define STM32N6_ATON_NS_ALIAS_BASE   0x24000000
#define STM32N6_ATON_NS_ALIAS_SIZE   0x00400000

/* Physical view of the same RAM (SRAM3..6 and the NPU cache RAM).  The RISAF
 * filters by address, so both views are opened: the CPU and the model use the
 * alias (a non-secure transaction by construction) and the NPU may end up
 * presenting either.
 */

#define STM32N6_ATON_NS_PHYS_BASE    0x34200000
#define STM32N6_ATON_NS_PHYS_SIZE    0x00200000

/* The epoch program buffers and the user I/O tensors live in the XSPI1
 * HyperRAM, which no CPU-side code uses and which is inside no address space
 * that also holds CPU data.
 */

#define STM32N6_ATON_NS_HPRAM_BASE   0x90000000
#define STM32N6_ATON_NS_HPRAM_SIZE   0x00400000

/* The blob window: inside the NPU RAM non-secure window (the only one RISAF
 * lets a non-secure master and the SAU-marked CPU accesses through), but above
 * the region the model's tensors actually use - max(offset_end) over its
 * tables.  SRAM2 is not an option: RISAF2/3 keep it secure-only, so NS writes
 * there are denied silently, and the kernel's own .bss lives in it.
 */

/* The application's input buffer (see apps/examples/palm_cam).  The model's
 * input pointer has to be registered with this address before the epoch
 * program is published.
 */

/* Size of the .nsblob section (the epoch program and its secondary blobs as
 * the linker placed them in the non-secure window).  It is the amount of
 * memory that has to be cleaned out of the CPU data cache before the NPU
 * fetches the program.
 */

/* NOTE: this used to be a hardcoded 0x7620, which happens to be palm995's
 * blob size - a leftover from a single-model build.  With two models linked
 * in, the section holds both blobs, so derive it from the linker symbols.
 */

#define STM32N6_ATON_NS_BLOB_SIZE     ((uint32_t)((uintptr_t)_ensblob - \
                                                  (uintptr_t)_snsblob))

/* RIMC master attribute register 1: the security attributes of the ATON
 * (NPU) master.  MSEC (bit 8) | MPRIV (bit 9) | MCID (bits 6:4) = CID 1.
 */

#define STM32N6_ATON_RIMC_ATTR1       0x54024c14

