open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_aton_aie.c
/* The application's input buffer.  A model's input pointer has to be
 * registered with this address before its epoch program is published.
 *
 * Both slots of a two-model build share it.  The non-secure window is 608 KB
 * (0x24328000..0x243c0000) and the two .nsblob segments take 224 KB of that,
 * which leaves 384 KB - not enough for two tensors side by side, since the eye
 * classifier wants 24 KB and the face detector 312 KB.  Sharing is safe
 * because the application runs the models in sequence over one frame: the face
 * tensor is dead the moment its inference returns, and the eye crop is taken
 * from the camera frame, never from what the face network was fed.
 *
 * The address sits past the blobs: .nsblob runs from 0x24328000 to about
 * 0x24369210 once the face model's two SW-epoch programs are in it, and
 * 0x2436c000 + 0x4e000 = 0x243ba000 stays below the end of the window at
 * 0x243c0000 with 24 KB to spare.  Mind the order - 94% of the window is
 * spoken for, and the blobs growing into the buffer would corrupt both
 * silently.  stm32n6_aton_aie_init() checks the two against each other.
 *
 * Keep the size in step with the largest model input:
 * stm32n6_aton_publish_model() refuses a model whose tensor does not fit.
 */

#define STM32N6_ATON_APP_INPUT_BASE  0x2436c000
#define STM32N6_ATON_APP_INPUT_SIZE  0x4e000     /* 319488 = 1x3x256x416 i8 */

#define STM32N6_ATON_NS_WINDOW_BASE  0x24328000
/* 608 KB: widened from 144 KB (0x24000) on 2026-09-17 for the eye model,
 * whose epoch program is 172 KB.  flash.ld documents
 * 0x24328000..0x243C0000 as free, hence LENGTH = 0x243C0000 - 0x24328000.
 * The two values must stay in sync.
 */

#define STM32N6_ATON_NS_WINDOW_SIZE  0x00098000

/* Read and write enable for every CID (RDENC0..7 | WRENC0..7 << 16). */

#define STM32N6_ATON_RISAF_CIDCFGR_OPEN  0x00ff00ff

/* Whole address space of the instance (STARTR/ENDR are offsets inside the
 * space that the RISAF instance protects).
 *
 * RISAF4/RISAF5/RISAF6 report a 4 GB space, but 0xffffffff must not be used:
 * the end address is compared as "addr < limit + 1", so 0xffffffff overflows
 * to 0 and every access is rejected (a mistake already made in the FSBL, see
 * stm32n6-rif-fsbl notes: "EndAddress=0xFFFFFFFF will fail the 32-bit
 * overflow assert -> use 0x3FFFFFFF").  0x3FFFFFFF covers the 0x34000000
 * based AXISRAM windows with room to spare.  RISAF8 guards the 256 KB NPU
 * CACHEAXI RAM, whose published limit is 0x0003ffff.
 */

#define STM32N6_ATON_RISAF4_6_END        0x3fffffff
#define STM32N6_ATON_RISAF8_END          0x0003ffff

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Per-slot state.  Tensors, buffers and counters belong to a model; only
 * the IRQ count and the epoch-event count stay global, because there is one
 * NPU and one epoch controller, and the models run on it one after the other.
 */

struct stm32n6_aton_model_s
{
  uint32_t runs;        /* Inferences this slot completed              */
  uint32_t last_usec;   /* Duration of its last inference              */
  int      last_result; /* Result of its last inference                */
  uint32_t input_addr;  /* Address its program was published with      */
  uint32_t input_size;  /* Its input tensor size in bytes              */
  uint32_t output_addr; /* Where its output lives inside the NPU pool  */
  uint32_t output_size; /* Span of its output tensors in bytes         */
  bool     published;   /* The epoch controller accepted its program   */
  bool     warned;      /* The "fed the wrong buffer" note was printed */
};

struct stm32n6_aton_lowerhalf_s
{
  struct aie_lowerhalf_s lower;  /* Common lower-half interface (ops first) */

  mutex_t                lock;   /* Serialise access to the NPU */
  bool                   opened; /* Session (AIE_CMD_LOAD) active */
  uint32_t               irq_count;   /* Stray NPU interrupts (diagnostics) */
  uint32_t               events;      /* NPU epoch-complete events */

  struct stm32n6_aton_model_s model[ATON_MODEL_NMODELS];
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static FAR void *stm32n6_aton_aie_init(FAR struct aie_lowerhalf_s *lower,
                                       uintptr_t model);
static int stm32n6_aton_aie_deinit(FAR struct aie_lowerhalf_s *lower,
                                   FAR void *context);
static int stm32n6_aton_aie_feed_input(FAR struct aie_lowerhalf_s *lower,
                                       FAR void *context, uintptr_t input);
static int stm32n6_aton_aie_get_output(FAR struct aie_lowerhalf_s *lower,
                                       FAR void *context, uintptr_t output);
static int stm32n6_aton_aie_control(FAR struct aie_lowerhalf_s *lower,
                                    FAR void *context, int cmd,
                                    unsigned long arg);

/* NPU interrupt handler (one per NVIC line; all forward to a helper) */

static int stm32n6_aton_npu_irq(int irq, FAR void *context, FAR void *arg);

/* Inference watchdog: reports progress and breaks interrupt storms */

static int stm32n6_aton_watchdog(int argc, FAR char *argv[]);

/* Raw (polled, unbuffered) output used by the heartbeat */

static void stm32n6_aton_wd_puts(FAR const char *str);
static void stm32n6_aton_wd_u32(uint32_t value);
static void stm32n6_aton_wd_hex(uint32_t value);
static void stm32n6_aton_risaf_clear(void);
static void stm32n6_aton_weights_check(void);
static void stm32n6_aton_matrix_probe(void);
static void stm32n6_aton_npu_clocks_on(void);

/* Console transmitter state (stm32n6_serial.c): printed with raw output so it
 * is visible even when the console driver itself is what is stuck.
 */

void stm32n6_console_dump(void);

/* Recover a lost console TX wakeup (see stm32n6_serial.c) */

void stm32n6_console_unstick(void);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Set while an inference is in flight, read by the watchdog thread */

static volatile bool g_aton_run_active;
static bool          g_aton_wd_started;

/* The watchdog must never compete with the application: it runs at the work
 * queue priority (below every user task), so even if its sleep ever returned
 * early it could not starve anything.
 */

#define ATON_WD_PRIORITY   224
#define ATON_WD_STACKSIZE  4096
#define ATON_WD_PERIOD_US  (2 * 1000 * 1000)

static const struct aie_ops_s g_stm32n6_aton_aie_ops =
{
  .init       = stm32n6_aton_aie_init,
  .deinit     = stm32n6_aton_aie_deinit,
  .feed_input = stm32n6_aton_aie_feed_input,
  .get_output = stm32n6_aton_aie_get_output,
  .control    = stm32n6_aton_aie_control,
};

