open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_aton_aie.c
/* NVIC interrupt numbers handled by this driver */

static const int g_stm32n6_aton_npu_irqs[] =
{
  STM32_IRQ_NPU0,
  STM32_IRQ_NPU1,
  STM32_IRQ_NPU2,
  STM32_IRQ_NPU3
};

#define STM32N6_ATON_NIRQS \
  (sizeof(g_stm32n6_aton_npu_irqs) / sizeof(g_stm32n6_aton_npu_irqs[0]))

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32n6_aton_npu_irq
 *
 * Description:
 *   NPU interrupt handler.  The Neural-ART NPU raises up to four interrupt
 *   lines (epoch end + three error lines, aliased to NVIC 53..56).
 *
 *   This handler is installed at boot so that the lines never fall through
 *   to NuttX's "unexpected interrupt" path.  Once the ATON runtime starts
 *   an inference (LL_ATON_RT_Main) it installs its OWN handler for line 0
 *   (ATON_STD_IRQHandler == NPU0_IRQHandler) through the OSAL hook
 *   LL_ATON_OSAL_INSTALL_IRQ(); that handler clears the ATON interrupt
 *   controller status and signals LL_ATON_OSAL_WFE(), so it replaces this
 *   one for the duration of the epoch loop (see ll_aton_osal_nuttx.c).
 *
 *   The handler must stay SILENT: the NSH console (USART1) is interrupt
 *   driven, so a syslog()/_info()/_err() call from interrupt context fights
 *   the task that owns the console and freezes the shell (observed
 *   2026-09-11 right after aie_probe returned).  Enabling
 *   CONFIG_SYSLOG_INTBUFFER to make such prints "safe" is NOT an option on
 *   this board either: it corrupted the NuttX heap (mm.h:354 assert that
 *   reproduces on the first task spawn after boot).
 *
 *   If diagnostics are needed, accumulate state here and expose it from
 *   task context (ioctl) instead of printing.
 *
 ****************************************************************************/

static int stm32n6_aton_npu_irq(int irq, FAR void *context, FAR void *arg)
{
  FAR struct stm32n6_aton_lowerhalf_s *priv =
    (FAR struct stm32n6_aton_lowerhalf_s *)arg;

  UNUSED(irq);
  UNUSED(context);

  /* Count stray interrupts for post-mortem diagnostics (task context only).
   * While an inference is running the ATON runtime's handler is installed
   * instead of this one, so this counter only sees interrupts raised while
   * no session is active.
   */

  if (priv != NULL)
    {
      priv->irq_count++;
    }

  return OK;
}

/****************************************************************************
 * Name: stm32n6_aton_rif_fault_dump
 *
 * Description:
 *   Report and clear any RISAF illegal-access records.  Called after a failed
 *   inference: a bus error seen by the NPU (e.g. reading the model weights in
 *   the external NOR or the tensor pool in AXISRAM3..6) shows up here as a
 *   non-zero IASR of the region that rejected the access.
 *
 ****************************************************************************/

static void stm32n6_aton_rif_fault_dump(void)
{
  static const uint32_t risaf[STM32N6_ATON_NRISAF] =
  {
    STM32N6_ATON_RISAF1_BASE, STM32N6_ATON_RISAF2_BASE,
    STM32N6_ATON_RISAF3_BASE, STM32N6_ATON_RISAF4_BASE,
    STM32N6_ATON_RISAF5_BASE, STM32N6_ATON_RISAF6_BASE,
    STM32N6_ATON_RISAF7_BASE, STM32N6_ATON_RISAF8_BASE,
    STM32N6_ATON_RISAF9_BASE, STM32N6_ATON_RISAF11_BASE,
    STM32N6_ATON_RISAF12_BASE, STM32N6_ATON_RISAF13_BASE
  };

  int i;

  for (i = 0; i < STM32N6_ATON_NRISAF; i++)
    {
      uint32_t iasr  = getreg32(risaf[i] + STM32N6_ATON_RISAF_IASR);
      uint32_t iaesr;
      uint32_t iaddr;

      if (iasr == 0)
        {
          continue;
        }

      /* IASR only carries the flags; the failing master and the address live
       * in the per-entry registers (RISAF_IAESR = base + 0x20,
       * RISAF_IADDR = base + 0x24):
       *
       *   IAESR[2:0] = IACID   (compartment id of the offending master)
       *   IAESR[4]   = IAPRIV  (master was privileged)
       *   IAESR[5]   = IASEC   (master was secure)
       *   IAESR[7]   = IANRW   (1 = write, 0 = read)
       */

      iaesr = getreg32(risaf[i] + STM32N6_ATON_RISAF_IAESR);
      iaddr = getreg32(risaf[i] + STM32N6_ATON_RISAF_IADDR);

      stm32n6_aton_wd_puts("[risaf-fault] risaf");
      stm32n6_aton_wd_u32(i + 1);
      stm32n6_aton_wd_puts(" addr=");
      stm32n6_aton_wd_hex(iaddr);
      stm32n6_aton_wd_puts(" cid=");
      stm32n6_aton_wd_u32(iaesr & 0x7);
      stm32n6_aton_wd_puts((iaesr & 0x20) ? " sec" : " ns");
      stm32n6_aton_wd_puts((iaesr & 0x10) ? " priv" : " unpriv");
      stm32n6_aton_wd_puts((iaesr & 0x80) ? " write" : " read");
      stm32n6_aton_wd_puts(" iaesr=");
      stm32n6_aton_wd_hex(iaesr);
      stm32n6_aton_wd_puts(" iasr=");
      stm32n6_aton_wd_hex(iasr);
      stm32n6_aton_wd_puts("\r\n");

      /* Show the policy of the region that rejected the access: CFGR carries
       * BREN/SEC/PRIVC0..7, CIDCFGR the per-CID read/write enables.
       */

      stm32n6_aton_wd_puts("[risaf-fault] risaf");
      stm32n6_aton_wd_u32(i + 1);
      stm32n6_aton_wd_puts(" region0 cfgr=");
      stm32n6_aton_wd_hex(getreg32(risaf[i] + STM32N6_ATON_RISAF_REG0 + 0x00));
      stm32n6_aton_wd_puts(" start=");
      stm32n6_aton_wd_hex(getreg32(risaf[i] + STM32N6_ATON_RISAF_REG0 + 0x04));
      stm32n6_aton_wd_puts(" end=");
      stm32n6_aton_wd_hex(getreg32(risaf[i] + STM32N6_ATON_RISAF_REG0 + 0x08));
      stm32n6_aton_wd_puts(" cidc=");
      stm32n6_aton_wd_hex(getreg32(risaf[i] + STM32N6_ATON_RISAF_REG0 + 0x0c));
      stm32n6_aton_wd_puts("\r\n");

      putreg32(iasr, risaf[i] + STM32N6_ATON_RISAF_IACR);
    }
}

/****************************************************************************
 * Name: stm32n6_aton_risaf_open
 *
 * Description:
 *   Open the whole address space of one RISAF instance to every compartment
 *   ID, using the same policy word that the board FSBL uses for the windows
 *   it programs (BREN | SEC | all CIDs privileged, read and write enabled for
 *   every CID).
 *
 *   This exists because the FSBL leaves RISAF4/RISAF5/RISAF6 - the blocks
 *   that guard the large AXISRAM windows, i.e. the NPU tensor pool at
 *   0x34200000 (RM0486 Table 24) - completely unprogrammed, and an
 *   unprogrammed RISAF falls back to its reset rule ("secure, privileged and
 *   CID 1 only", RM0486 7.4.3).  Writes to those blocks had to be skipped in
 *   the FSBL because they took the boot down; doing it here, with the RISAF
 *   clock already running, lets the NPU reach its own memory.
 *
 *   Without this the epoch controller cannot fetch its program, which is what
 *   EC_IRQ ERR_START ("wrong blob ID") reports.
 *
 ****************************************************************************/

static void stm32n6_aton_risaf_region(uint32_t base, int region,
                                      uint32_t start, uint32_t end,
                                      uint32_t cfgr)
{
  uint32_t r = base + STM32N6_ATON_RISAF_REG0 +
               (uint32_t)region * STM32N6_ATON_RISAF_REGION_STRIDE;

  /* Program start/end and the CID grants first, enable the region last so
   * that it never matches with half of its attributes in place.
   */

  putreg32(start, r + 0x04);
  putreg32(end, r + 0x08);
  putreg32(STM32N6_ATON_RISAF_CIDCFGR_OPEN, r + 0x0c);
  putreg32(cfgr, r + 0x00);
}

/* Subregion A of base region x: disabled while the addresses change, then
 * enabled with the granted rights.
 */

static void stm32n6_aton_risaf_subregion(uint32_t base, int region,
                                         uint32_t start, uint32_t end,
                                         uint32_t acfgr)
{
  uint32_t r = base + STM32N6_ATON_RISAF_REG0 +
               (uint32_t)region * STM32N6_ATON_RISAF_REGION_STRIDE;

