open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_aton_aie.c
  putreg32(0, r + STM32N6_ATON_RISAF_REG_ACFGR);
  putreg32(start, r + STM32N6_ATON_RISAF_REG_ASTARTR);
  putreg32(end, r + STM32N6_ATON_RISAF_REG_AENDR);
  putreg32(0, r + STM32N6_ATON_RISAF_REG_ANESTR);
  putreg32(acfgr, r + STM32N6_ATON_RISAF_REG_ACFGR);
}

/****************************************************************************
 * Name: stm32n6_aton_ns_setup
 *
 * Description:
 *   Open the non-secure alias windows that the NPU needs, and tell the SAU
 *   that those addresses are non-secure for the CPU as well.
 *
 *   RISAF1 and RISAF4/RISAF5/RISAF6 all describe the whole 4 GB address map
 *   (their address space limit is 0xFFFFFFFF), so the window has to be carved
 *   out of the middle of each of them: region 0 keeps the low part of the map
 *   secure, region 2 keeps the high part secure - the CPU's own code and data
 *   at 0x3400_0000.. live in that one - and region 1 is the non-secure window.
 *
 *   The write order matters: the CPU never touches 0x2400_0000.. before this
 *   function returns, so the extra secure region is installed first, the
 *   non-secure window second and the secure region 0 is narrowed last.  Any
 *   other order would leave an instant in which the CPU finds no region
 *   covering the RAM it is running from, and an unmatched access is denied.
 *
 ****************************************************************************/

static void stm32n6_aton_ns_setup(void)
{
  static const uint32_t instances[4] =
  {
    STM32N6_ATON_RISAF1_BASE, STM32N6_ATON_RISAF4_BASE,
    STM32N6_ATON_RISAF5_BASE, STM32N6_ATON_RISAF6_BASE
  };

  int i;

  for (i = 0; i < 4; i++)
    {
      uint32_t base = instances[i];

      /* Overlap-free layout, written in an order that never leaves the CPU
       * uncovered: the extra secure regions go in while region 0 still spans
       * the whole map, and region 0 is narrowed last.
       *
       *   0: secure     [0x0000_0000, 0x23FF_FFFF]  low map
       *   1: non-secure [0x2400_0000, 0x243F_FFFF]  alias view of SRAM1..6+cache
       *   2: secure     [0x2440_0000, 0x341F_FFFF]  CPU RAM: image, heap, stacks
       *   3: non-secure [0x3420_0000, 0x343F_FFFF]  physical view of NPU RAM
       *   4: secure     [0x3440_0000, 0x3FFF_FFFF]  rest of the map
       */

      stm32n6_aton_risaf_region(base, 2, 0x24400000, 0x341fffff,
                                STM32N6_ATON_RISAF_CFGR_SEC_OPEN);
      stm32n6_aton_risaf_region(base, 4, 0x34400000, 0x3fffffff,
                                STM32N6_ATON_RISAF_CFGR_SEC_OPEN);
      stm32n6_aton_risaf_region(base, 1, STM32N6_ATON_NS_ALIAS_BASE,
                                STM32N6_ATON_NS_ALIAS_BASE +
                                STM32N6_ATON_NS_ALIAS_SIZE - 1,
                                STM32N6_ATON_RISAF_CFGR_NS_OPEN);
      stm32n6_aton_risaf_region(base, 3, STM32N6_ATON_NS_PHYS_BASE,
                                STM32N6_ATON_NS_PHYS_BASE +
                                STM32N6_ATON_NS_PHYS_SIZE - 1,
                                STM32N6_ATON_RISAF_CFGR_NS_OPEN);
      stm32n6_aton_risaf_region(base, 0, 0, 0x23ffffff,
                                STM32N6_ATON_RISAF_CFGR_SEC_OPEN);
    }

  /* RISAF2/RISAF3 are left alone, and no external memory is touched: the
   * non-secure window lives in the free tail of the NPU's own RAM, which
   * only RISAF1/4/5/6 describe.
   */

  /* RISAF2 and RISAF3 are left exactly as the FSBL and r13 had them: region 0
   * secure over their whole one megabyte space.
   *
   * They guard the CPU AXI RAMs - the RAM the NuttX heap lives in - and r14
   * showed what a second, non-secure region there does: the overlapping pair
   * captured the CPU's own secure accesses, the writes were dropped without a
   * fault, the free-list metadata went stale and mm_malloc() tripped on it.
   * Their address space base cannot be pinned down from software either, so
   * there is no safe way to carve them: the non-secure window simply stays
   * out of the RAM they protect.
   */

  /* RISAF8 guards the NPU cache RAM (0x343C_0000, 256 KB).  Region 0 stays at
   * its reset value (disabled) and a single non-secure region covers all of
   * it: the cache carries the NPU's non-secure traffic and nothing else uses
   * that RAM.
   */

  stm32n6_aton_risaf_region(STM32N6_ATON_RISAF8_BASE, 0, 0, 0, 0);
  stm32n6_aton_risaf_region(STM32N6_ATON_RISAF8_BASE, 1, 0, 0x3ffff,
                            STM32N6_ATON_RISAF_CFGR_NS_OPEN);

  /* Mark the window non-secure for the CPU too.  The alias already selects
   * the non-secure domain, but making the SAU say so as well removes any
   * dependence on the IDAU's view of those addresses.
   */

  stm32n6_aton_wd_puts("[ns] sau ctrl 0x");
  stm32n6_aton_wd_hex(getreg32(STM32N6_ATON_SAU_CTRL));
  stm32n6_aton_wd_puts(" -> ");

  /* Disable the SAU while programming it, as the architecture requires.  With
   * the SAU off every address is secure, which is also how the CPU has been
   * running so far, so this is safe.
   */

  putreg32(0, STM32N6_ATON_SAU_CTRL);

  stm32n6_aton_sau_ns_region(0, STM32N6_ATON_NS_ALIAS_BASE,
                             STM32N6_ATON_NS_ALIAS_SIZE);

  /* ENABLE = 1, ALLNS = 0: only the region above is non-secure, everything
   * else keeps its default secure attribute.
   */

  putreg32(0x1, STM32N6_ATON_SAU_CTRL);

  stm32n6_aton_wd_hex(getreg32(STM32N6_ATON_SAU_CTRL));
  stm32n6_aton_wd_puts("\r\n");

  /* The window holds a NOLOAD section, so nothing initialises it at startup:
   * clear it before the epoch buffers are filled in.
   *
   * This is the first access the CPU makes through the non-secure alias, so
   * announce it: if the firmware stops here, the bus error is that access and
   * nothing else.
   */

  stm32n6_aton_wd_puts("[ns] priming npu ram 0x");
  stm32n6_aton_wd_hex(STM32N6_ATON_NS_WINDOW_BASE);
  stm32n6_aton_wd_puts("..0x");
  stm32n6_aton_wd_hex(STM32N6_ATON_NS_WINDOW_BASE +
                      STM32N6_ATON_NS_WINDOW_SIZE);
  stm32n6_aton_wd_puts(" ");

  memset((void *)STM32N6_ATON_NS_WINDOW_BASE, 0,
         STM32N6_ATON_NS_WINDOW_SIZE);

