open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_aton_aie.c
  stm32n6_aton_wd_puts("ok\r\n");

  /* r32: the eleven secondary epoch blobs are copied into this window by the
   * start-up path, and the clear above reaches into the copies (they start at
   * 0x242e4000 and run up to 0x24317b50, so the tail of the window overlaps
   * them).  Take the copies again here, after the clear, so the order cannot
   * matter, and print the checksum: the same value as the earlier copy proves
   * the window is stable.
   */

#ifdef CONFIG_LIB_AI_ATON
  stm32n6_aton_wd_puts("[nsblob] re-copy after clear sum=");
  stm32n6_aton_wd_hex(aton_model_blob_sync(ATON_MODEL_PRIMARY));
  stm32n6_aton_wd_puts("\r\n");
#endif

  stm32n6_aton_wd_puts("[ns] blobs at 0x");
  stm32n6_aton_wd_hex((uint32_t)(uintptr_t)_snsblob);
  stm32n6_aton_wd_puts("..0x");
  stm32n6_aton_wd_hex((uint32_t)(uintptr_t)_ensblob);
  stm32n6_aton_wd_puts(", window 0x");
  stm32n6_aton_wd_hex(STM32N6_ATON_NS_WINDOW_BASE);
  stm32n6_aton_wd_puts("+0x");
  stm32n6_aton_wd_hex(STM32N6_ATON_NS_WINDOW_SIZE);
  stm32n6_aton_wd_puts("\r\n");

  /* Start the model run from a clean slate: anything latched from here on was
   * caused by the NPU (or the probe), not by bring-up.
   */

  stm32n6_aton_risaf_clear();

  /* The NPU's own error latches (one bit per AXI bus port) and the cache
   * error flag: clear them so the run starts from a known state.
   */

  putreg32(getreg32(STM32_ATON_BUSIF0_ERR), STM32_ATON_BUSIF0_ERR);
  putreg32(getreg32(STM32_ATON_BUSIF1_ERR), STM32_ATON_BUSIF1_ERR);
  putreg32(CACHEAXI_FCR_CERRF, STM32_CACHEAXI_FCR);

  stm32n6_aton_wd_puts("[risaf] illegal-access latches cleared\r\n");

  /* Hardware ground truth about what a rejected read looks like. */

  stm32n6_aton_matrix_probe();
}

/****************************************************************************
 * Name: stm32n6_aton_nor_domain_sweep
 *
 * Description:
 *   Decide by measurement which security-domain configuration lets both the
 *   secure and the non-secure readers reach the model weights in the external
 *   NOR.  The two previous rounds proved that both kinds of reader exist:
 *
 *     r51 (window = non-secure only)  secure reader refused
 *                                     (risaf11 addr=0x703246e8, iaesr=0x31)
 *     r52 (window = secure only)      non-secure readers refused
 *                                     (risaf4/5 addr=0x7030b3a0/0x70316700,
 *                                      iaesr=0x11)
 *
 *   A refusal is silent - the read returns zeros without stalling or raising
 *   an error - so either polarity poisons the inference invisibly.  RM0486
 *   7.4.4 makes an address no enabled base region covers secure-only (the
 *   vendor example relies on that reset rule), CFGR.SEC lets one base region
 *   serve exactly one domain, and Table 26 lets a secure privileged base
 *   region carry a non-secure subregion: that last shape is the one that can
 *   serve both domains over the same bytes.
 *
 *   Candidates, programmed on the four RISAFs that see NOR traffic (the NPU's
 *   two AXI masters and the two XSPI instances), each probed through a normal
 *   secure read and an SAU-forced non-secure read of the same weight word and
 *   of one of the addresses r52 saw refused:
 *
 *     cfg0  no window at all (reset default rule)
 *     cfg1  non-secure base region           (r51)
 *     cfg2  secure base region               (r52)
 *     cfg3  secure base + non-secure subregion A
 *     cfg4  non-secure base + secure subregion A
 *
 *   The first configuration that serves both domains at both addresses wins.
 *   If none does, cfg2 is kept: the r52 run with it produced real numbers,
 *   while the r51 polarity produced nothing but zeros.
 *
 ***************************************************************************/

static uint32_t stm32n6_aton_nor_probe(uint32_t addr, uint32_t *ns)
{
  stm32n6_aton_risaf_clear();
  *ns = stm32n6_aton_ns_read32(1, addr);

  /* stm32n6_aton_ns_read32() invalidates the line it read; do the same
   * for the secure read, or this one is answered from the line the
   * previous configuration filled and every candidate looks identical.
   */

  up_invalidate_dcache((uintptr_t)addr & ~31u,
                       ((uintptr_t)addr & ~31u) + 32u);
  return getreg32(addr);
}

static void stm32n6_aton_nor_domain_apply(int cfg)
{
  static const uint32_t instances[4] =
  {
    STM32N6_ATON_RISAF4_BASE, STM32N6_ATON_RISAF5_BASE,
    STM32N6_ATON_RISAF12_BASE, STM32N6_ATON_RISAF11_BASE
  };

  static const int regions[4] = { 5, 5, 0, 0 };

  int i;

  for (i = 0; i < 4; i++)
    {
      uint32_t base   = instances[i];
      int      region = regions[i];

      stm32n6_aton_risaf_subregion(base, region, 0, 0, 0);
      stm32n6_aton_risaf_region(base, region, 0, 0, 0);

      if (cfg == 0)
        {
          continue;
        }

      stm32n6_aton_risaf_region(base, region, 0x70200000, 0x70734fff,
                                (cfg == 1 || cfg == 4)
                                  ? STM32N6_ATON_RISAF_CFGR_NS_OPEN
                                  : STM32N6_ATON_RISAF_CFGR_SEC_OPEN);

      if (cfg == 3 || cfg == 4)
        {
          stm32n6_aton_risaf_subregion(base, region, 0x70200000, 0x70734fff,
                                       STM32N6_ATON_RISAF_SR_SREN |
                                       STM32N6_ATON_RISAF_SR_RDEN |
                                       STM32N6_ATON_RISAF_SR_WREN |
                                       (cfg == 4
                                          ? STM32N6_ATON_RISAF_SR_SEC : 0));
        }
    }
}

static void stm32n6_aton_nor_domain_sweep(void)
{
  int cfg;
  int keep = 2;

  for (cfg = 0; cfg <= 4; cfg++)
    {
      uint32_t ns_a;
      uint32_t ns_b;
      uint32_t sec_a;
      uint32_t sec_b;

      stm32n6_aton_nor_domain_apply(cfg);

      sec_a = stm32n6_aton_nor_probe(0x70200000u, &ns_a);
      sec_b = stm32n6_aton_nor_probe(0x7030b3a0u, &ns_b);

      stm32n6_aton_wd_puts("[nor-sw] cfg");
      stm32n6_aton_wd_u32((uint32_t)cfg);
      stm32n6_aton_wd_puts(" a: sec=");
      stm32n6_aton_wd_hex(sec_a);
      stm32n6_aton_wd_puts(" ns=");
      stm32n6_aton_wd_hex(ns_a);
      stm32n6_aton_wd_puts(" b: sec=");
      stm32n6_aton_wd_hex(sec_b);
      stm32n6_aton_wd_puts(" ns=");
      stm32n6_aton_wd_hex(ns_b);
      stm32n6_aton_wd_puts(" latches:");
      stm32n6_aton_latch_report();
      stm32n6_aton_wd_puts("\r\n");

