open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_aton_aie.c
      if (sec_a == ns_a && ns_a != 0 && sec_b == ns_b && ns_b != 0)
        {
          keep = cfg;
        }
    }

  stm32n6_aton_nor_domain_apply(keep);

  {
    uint32_t ns_a;
    uint32_t sec_a = stm32n6_aton_nor_probe(0x70200000u, &ns_a);

    stm32n6_aton_risaf_clear();
    stm32n6_aton_wd_puts("[nor-sw] kept cfg");
    stm32n6_aton_wd_u32((uint32_t)keep);
    stm32n6_aton_wd_puts(" sec=");
    stm32n6_aton_wd_hex(sec_a);
    stm32n6_aton_wd_puts(" ns=");
    stm32n6_aton_wd_hex(ns_a);
    stm32n6_aton_wd_puts("\r\n");
  }

  stm32n6_aton_risaf_clear();
}

/****************************************************************************
 * Name: stm32n6_aton_risaf_nor_open
 *
 * Description:
 *   Let a non-secure master read the model weights, which live in the
 *   external NOR at 0x7020_0000..0x705F_FFFF.  The NPU latched exactly that
 *   denial in r31 (IAESR cid=1 ns priv read, IADDR = 0x7052_9750), and a
 *   denied read does not stall the master - it just returns zeros, so the
 *   engines were fed empty weights while the epoch still "completed".
 *
 *   Four RISAFs see that traffic:
 *
 *     RISAF4 / RISAF5  the NPU's two AXI masters: their address space is the
 *                      whole 4 GB map, so the region is programmed with
 *                      absolute addresses;
 *     RISAF12          XSPI2, the NOR: its protection space starts at
 *                      0x7000_0000, so the same bytes are addressed relative
 *                      to that base (0x0020_0000..0x005F_FFFF);
 *     RISAF11          XSPI1: left at reset, but the latches showed the NPU's
 *                      NOR reads reaching it as well, so it gets the window too.
 *
 *   The XSPI RISAFs have every region disabled at reset, so region 0 is free
 *   and it has the highest priority: nothing can shadow the new window.  On
 *   RISAF4/RISAF5 the region index 5 is the first unused one (0..4 carry the
 *   RAM windows) and it is out of the way of every other region.
 *
 *   Reads stay possible for the CPU as well: an "open" region only enables
 *   the access bits it was given, and the secure read path through such a
 *   region works (r20 proved it) - the XSPI driver keeps reading code and
 *   file data through 0x7000_0000.
 *
 ****************************************************************************/

/* --- r73 performance instrumentation ------------------------------------ */

static bool     g_aton_perf_diag = true;  /* per-run diagnostics (run 1 only) */
static unsigned g_aton_perf_runs;         /* inferences since boot            */
static uint32_t g_aton_perf_c0;           /* DWT stamp: before the prep       */
static uint32_t g_aton_perf_c1;           /* ... before the NPU run           */
static uint32_t g_aton_perf_c2;           /* ... after the NPU run            */
static uint32_t g_aton_perf_c3;

/* The DWT cycle counter is enabled by the ATON OSAL (DEMCR.TRCENA plus
 * DWT_CTRL.CYCCNTENA); reading it costs a couple of cycles and gives the
 * CPU-side phases a resolution the 1 ms system timer cannot offer.
 */

#define STM32N6_ATON_DWT_CYCCNT 0xe0001004u

static uint32_t stm32n6_aton_cyccnt(void)
{
  return getreg32(STM32N6_ATON_DWT_CYCCNT);
}

/****************************************************************************
 * Name: stm32n6_aton_weights_check
 *
 * Description:
 *   Check that the model weights are still present in the external NOR.
 *
 *   The model weights live in the external NOR and are programmed separately
 *   from files that carry their own addresses: the eye model's initializers at
 *   0x70400000 (eye_flash/eye-data.hex, 2,899,745 B) and the face model's at
 *   0x70700000 (face_flash/face-data.hex, 109,105 B).  The NuttX image itself
 *   is loaded from 0x70100000 and must stay under 1 MiB, because the FSBL
 *   copies only that much into SRAM before jumping.
 *
 *   A flash run that overruns its window does not fail loudly: it silently
 *   overwrites the weights instead.  The NPU keeps running afterwards -
 *   deterministically, without an error and with the epoch events still
 *   arriving - so every later test measures garbage, the fill fingerprints
 *   shift and all detections come out negative.
 *
 *   That is what happened to the images flashed between r63 and r68: the four
 *   rounds spent on the compiler (-O0/-Os), on the preprocessing and on the
 *   tensor pool were all chasing a NOR that no longer held the model.  Hence
 *   this check - one line at boot says whether the weights are there.
 *
 ****************************************************************************/

/* The first six words are spread over the eye model's initializers
 * (0x70400000..0x706c3f21, 2,899,745 B, flashed from eye_flash/eye-data.hex);
 * the last five over the face model's (0x70700000..0x7071aa30, 109,105 B,
 * flashed from network_atonbuf.xSPI2.raw).  Neither range is all-zero or
 * erased, so a mismatch means the flash image is stale.
 */

static const uint32_t g_aton_weights_addr[] =
{
  0x70400000u, 0x70475f7cu, 0x704ebefcu,
  0x70561e7cu, 0x705d7dfcu, 0x7064dd7cu,
  0x70700000u, 0x70705534u, 0x7070aa6cu,
  0x7070ffa4u, 0x70715690u,
};

static const uint32_t g_aton_weights_want[] =
{
  /* v3 (five-class) fingerprint, read from eye_flash/eye_model_data.xSPI2.bin.
   * The previous values were the two-class model, so every boot reported the
   * weights as corrupted even though the flash image was byte-identical to the
   * file that had been flashed.  A stale fingerprint is worse than none: it
   * buries real faults under a permanent warning.
   */

  0xc2fc16fcu, 0xe9c11427u, 0xe3f70101u,
  0x75af3006u, 0xf2d011b9u, 0xd792203bu,
  0x000000e5u, 0x00fa0000u, 0x00005700u,
  0x1034f456u, 0x1636be44u,
};

#define STM32N6_ATON_WEIGHTS_NITEMS \
  (sizeof(g_aton_weights_addr) / sizeof(g_aton_weights_addr[0]))

static void stm32n6_aton_weights_check(void)
{
  unsigned int i;
  uint32_t ok = 0;

  for (i = 0; i < STM32N6_ATON_WEIGHTS_NITEMS; i++)
    {
      uint32_t got = getreg32(g_aton_weights_addr[i]);

      if (got == g_aton_weights_want[i])
        {
          ok++;
          continue;
        }

