open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_aton_aie.c
      stm32n6_aton_wd_puts("[aton] weights @");
      stm32n6_aton_wd_hex(g_aton_weights_addr[i]);
      stm32n6_aton_wd_puts(" = ");
      stm32n6_aton_wd_hex(got);
      stm32n6_aton_wd_puts(", want ");
      stm32n6_aton_wd_hex(g_aton_weights_want[i]);
      stm32n6_aton_wd_puts(" <<< MISMATCH\r\n");
    }

  stm32n6_aton_wd_puts("[aton] weights check: ");
  stm32n6_aton_wd_u32(ok);
  stm32n6_aton_wd_puts("/");
  stm32n6_aton_wd_u32((uint32_t)STM32N6_ATON_WEIGHTS_NITEMS);
  stm32n6_aton_wd_puts(" sampled words match - ");

  if (ok == STM32N6_ATON_WEIGHTS_NITEMS)
    {
      stm32n6_aton_wd_puts("the eye and face weights are in NOR\r\n");
    }
  else
    {
      stm32n6_aton_wd_puts("*** WEIGHTS CORRUPTED: re-flash "
                           "eye-data.hex at 0x70400000 and "
                           "face-data.hex at 0x70700000, and keep every "
                           "image <= 1 MiB ***\r\n");
    }

  /* Those reads go through the freshly reprogrammed window, so drop whatever
   * latch they produced: a stale one would look like a fresh NPU fault in a
   * later stall dump.
   */

  stm32n6_aton_risaf_clear();
}

static void stm32n6_aton_risaf_nor_open(void)
{
  /* The CPU still sees the weights until the non-secure region is in the way:
   * read them first, so one boot log shows both the "normal" values and what
   * the window does to a secure reader afterwards.
   */

  stm32n6_aton_wd_puts("[nor] cpu pre : w@eye=");
  stm32n6_aton_wd_hex(getreg32(0x70400000u));
  stm32n6_aton_wd_puts(" w@face=");
  stm32n6_aton_wd_hex(getreg32(0x70700000u));
  stm32n6_aton_wd_puts("\r\n");

  /* r52: the window serves the SECURE domain.  The r51 log latched
   * `risaf11 addr=703246e8 cid=1 sec priv read` during the model run: a
   * privileged secure read of a weight address was being refused because this
   * very region was opened for non-secure masters only - and a region serves
   * exactly one security domain.  A refused read neither stalls nor errors, it
   * returns zeros, so the engines were fed empty weights while the run still
   * reported success.  That is the all-+/-0.0 output of both models.
   *
   * Serving the secure domain matches the reset rule the vendor example relies
   * on (secure + privileged + CID1 allowed, nothing else programmed).  The
   * non-secure probe at the end of this function now expects zeros: the only
   * non-secure NOR reader we ever had was that probe itself.
   */

  /* r54: the NOR has TWO kinds of reader and one RISAF region serves a single
   * security domain:
   *
   *   the NPU's stream engines      non-secure   (r52/r53 latches: iaesr=0x11)
   *   the CPU-side software epochs  secure       (r51 showed their reads
   *                                              denied => output all +/-0.0)
   *
   * Splitting the range would need knowing which weights each side touches, so
   * instead the CPU's own view of the weight window is switched to the
   * non-secure domain - an SAU region, the same mechanism the probe helper
   * uses.  One non-secure window then covers every reader.
   *
   * The SAU must be disabled while its regions change, and region 0 (the SRAM
   * alias) has to be re-programmed in the same pass because the array is only
   * writable while the unit is off.
   */

  putreg32(0, STM32N6_ATON_SAU_CTRL);
  stm32n6_aton_sau_ns_region(0, STM32N6_ATON_NS_ALIAS_BASE,
                             STM32N6_ATON_NS_ALIAS_SIZE);
  stm32n6_aton_sau_ns_region(2, 0x70200000, 0x00540000);
  putreg32(0x1, STM32N6_ATON_SAU_CTRL);
  stm32n6_aton_wd_puts("[nor] sau: alias + weight window are non-secure\r\n");

  /* The sweep is kept for the record, but the winner is chosen by policy now:
   * with the SAU putting this window on the non-secure side for the CPU as
   * well, the non-secure configuration (cfg1) is the only one that serves BOTH
   * readers.  r54 let the sweep decide and it kept the secure window, which
   * sent the CPU-side readers back to zeros (checksum 0x00000000) - the same
   * failure mode r51 had, just from the other direction.
   */

  stm32n6_aton_nor_domain_sweep();
  stm32n6_aton_nor_domain_apply(1);
  stm32n6_aton_risaf_clear();
  stm32n6_aton_wd_puts("[nor] window forced to cfg1 (non-secure; serves the "
                       "SAU non-secure CPU and the NPU)\r\n");

  stm32n6_aton_wd_puts("[nor] window regs: risaf4 r6=");
  stm32n6_aton_wd_hex(getreg32(STM32N6_ATON_RISAF4_BASE + STM32N6_ATON_RISAF_REG0 +
                               5 * STM32N6_ATON_RISAF_REGION_STRIDE));
  stm32n6_aton_wd_puts(" risaf5 r6=");
  stm32n6_aton_wd_hex(getreg32(STM32N6_ATON_RISAF5_BASE + STM32N6_ATON_RISAF_REG0 +
                               5 * STM32N6_ATON_RISAF_REGION_STRIDE));
  stm32n6_aton_wd_puts(" risaf12 r1=");
  stm32n6_aton_wd_hex(getreg32(STM32N6_ATON_RISAF12_BASE + STM32N6_ATON_RISAF_REG0));
  stm32n6_aton_wd_puts(" risaf11 r1=");
  stm32n6_aton_wd_hex(getreg32(STM32N6_ATON_RISAF11_BASE + STM32N6_ATON_RISAF_REG0));
  stm32n6_aton_wd_puts("\r\n");

  /* The secure read the CPU performs here is the same kind of access the NPU's
   * weight port issues, so it must survive the window: the two words printed
   * below are the pass/fail line for r52.  They have to match `[nor] cpu pre`
   * (0xdbfd26e4 / 0x000000e5 for the eye / face models).
   */

  stm32n6_aton_wd_puts("[nor] cpu post: w@eye=");
  stm32n6_aton_wd_hex(getreg32(0x70400000u));
  stm32n6_aton_wd_puts(" w@face=");
  stm32n6_aton_wd_hex(getreg32(0x70700000u));
  stm32n6_aton_wd_puts(" (== cpu pre => the kept config serves the secure "
                      "domain)\r\n");

  /* That read was a deliberate secure access through a non-secure window, so it
   * latched RISAF11/RISAF12 as an illegal access.  Drop the latches again: a
   * stale one would look like a fresh NPU fault in any later stall dump, which
   * is exactly the kind of false lead that costs a whole round.
   */

  stm32n6_aton_risaf_clear();
  stm32n6_aton_wd_puts("[nor] latches cleared after the probe\r\n");

  /* Mirror image of the line above, and intentionally the failing direction
   * now: the window serves the secure domain, so a non-secure reader gets
   * zeros plus a latch.  Kept as evidence that the policy really changed.
   */

  stm32n6_aton_risaf_clear();
  stm32n6_aton_wd_puts("[nor-ns] ns read w@eye=");
  stm32n6_aton_wd_hex(stm32n6_aton_ns_read32(1, 0x70400000u));
  stm32n6_aton_wd_puts(" latches:");
  stm32n6_aton_latch_report();
  stm32n6_aton_risaf_clear();

