open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_aton_aie.c
  /* With the window in place, check that the model is still in the NOR: this
   * is the one failure mode that leaves every other sub-system green (no
   * busfault, epoch events arriving, plausible-looking logits) while all
   * detections are wrong.
   */

  stm32n6_aton_weights_check();
}

/****************************************************************************
 * Name: stm32n6_aton_risaf_map_dump
 *
 * Description:
 *   Print the protection map of RISAF1..RISAF9 (region 0 attributes plus the
 *   pending illegal-access flags) so a single boot log shows which address
 *   spaces are open to the NPU and which are not.
 *
 ****************************************************************************/

/****************************************************************************
 * Name: stm32n6_aton_risaf_xspi_dump
 *
 * Description:
 *   Dump the three RISAFs guarding the external memory windows (RISAF11 =
 *   XSPI1, RISAF12 = XSPI2/NOR, RISAF13 = XSPI3): their first four base
 *   regions plus the most recent latched illegal access.
 *
 *   A read that RISAF rejects returns zeros and latches IASR, and IAESR bit 5
 *   then says whether the rejected request was secure or non-secure.  If the
 *   NPU latched it, this is the direct answer to "may the NPU read the
 *   weights, and with which attributes".
 *
 ****************************************************************************/

static void stm32n6_aton_risaf_xspi_dump(void)
{
  static const uint32_t xspi[STM32N6_ATON_NXSPI] =
  {
    STM32N6_ATON_RISAF11_BASE,
    STM32N6_ATON_RISAF12_BASE,
    STM32N6_ATON_RISAF13_BASE
  };

  int i;
  int r;

  for (i = 0; i < STM32N6_ATON_NXSPI; i++)
    {
      uint32_t iasr  = getreg32(xspi[i] + STM32N6_ATON_RISAF_IASR);
      uint32_t iaesr = getreg32(xspi[i] + STM32N6_ATON_RISAF_IAESR);
      uint32_t iaddr = getreg32(xspi[i] + STM32N6_ATON_RISAF_IADDR);

      stm32n6_aton_wd_puts("[xspi] risaf");
      stm32n6_aton_wd_u32(11 + i);
      stm32n6_aton_wd_puts(" cr=");
      stm32n6_aton_wd_hex(getreg32(xspi[i] + STM32N6_ATON_RISAF_CR));
      stm32n6_aton_wd_puts(" iasr=");
      stm32n6_aton_wd_hex(iasr);
      stm32n6_aton_wd_puts(" iaesr=");
      stm32n6_aton_wd_hex(iaesr);
      stm32n6_aton_wd_puts(" iaddr=");
      stm32n6_aton_wd_hex(iaddr);

      if ((iasr & 0x2) != 0)
        {
          stm32n6_aton_wd_puts(" ILLEGAL cid=");
          stm32n6_aton_wd_u32(iaesr & 0x7);
          stm32n6_aton_wd_puts((iaesr & 0x20) ? " sec" : " ns");
          stm32n6_aton_wd_puts((iaesr & 0x10) ? " priv" : " unpriv");
          stm32n6_aton_wd_puts((iaesr & 0x80) ? " write" : " read");
        }

      stm32n6_aton_wd_puts("\r\n");

      for (r = 0; r < 4; r++)
        {
          uint32_t reg = xspi[i] + STM32N6_ATON_RISAF_REG0 +
                         (uint32_t)r * STM32N6_ATON_RISAF_REGION_STRIDE;

          stm32n6_aton_wd_puts("[xspi] risaf");
          stm32n6_aton_wd_u32(11 + i);
          stm32n6_aton_wd_puts(" r");
          stm32n6_aton_wd_u32(r + 1);
          stm32n6_aton_wd_puts(" cfgr=");
          stm32n6_aton_wd_hex(getreg32(reg + 0x00));
          stm32n6_aton_wd_puts(" start=");
          stm32n6_aton_wd_hex(getreg32(reg + 0x04));
          stm32n6_aton_wd_puts(" end=");
          stm32n6_aton_wd_hex(getreg32(reg + 0x08));
          stm32n6_aton_wd_puts(" cidc=");
          stm32n6_aton_wd_hex(getreg32(reg + 0x0c));
          stm32n6_aton_wd_puts("\r\n");
        }
    }
}

static void stm32n6_aton_risaf_map_dump(const char *tag)
{
  static const uint32_t risaf[STM32N6_ATON_NRISAF] =
  {
    STM32N6_ATON_RISAF1_BASE, STM32N6_ATON_RISAF2_BASE,
    STM32N6_ATON_RISAF3_BASE, STM32N6_ATON_RISAF4_BASE,
    STM32N6_ATON_RISAF5_BASE, STM32N6_ATON_RISAF6_BASE,
    STM32N6_ATON_RISAF7_BASE, STM32N6_ATON_RISAF8_BASE,
    STM32N6_ATON_RISAF9_BASE, STM32N6_ATON_RISAF11_BASE,
    STM32N6_ATON_RISAF12_BASE, STM32N6_ATON_RISAF13_BASE
  };

  int i;

  for (i = 0; i < STM32N6_ATON_NRISAF; i++)
    {
      uint32_t reg0 = risaf[i] + STM32N6_ATON_RISAF_REG0;

      /* Raw up_putc output on purpose: this has to survive a wedged console
       * and CONFIG_DEBUG_INFO is off in the NPU configuration, so _info()
       * would print nothing at all.
       */

      stm32n6_aton_wd_puts("[risaf-");
      stm32n6_aton_wd_puts(tag);
      stm32n6_aton_wd_puts("] risaf");
      stm32n6_aton_wd_u32(i + 1);
      stm32n6_aton_wd_puts(" cfgr=");
      stm32n6_aton_wd_hex(getreg32(reg0 + 0x00));
      stm32n6_aton_wd_puts(" start=");
      stm32n6_aton_wd_hex(getreg32(reg0 + 0x04));
      stm32n6_aton_wd_puts(" end=");
      stm32n6_aton_wd_hex(getreg32(reg0 + 0x08));
      stm32n6_aton_wd_puts(" cidc=");
      stm32n6_aton_wd_hex(getreg32(reg0 + 0x0c));
      stm32n6_aton_wd_puts(" iasr=");
      stm32n6_aton_wd_hex(getreg32(risaf[i] + STM32N6_ATON_RISAF_IASR));

      /* Region 1 is the non-secure window on the instances that carry one:
       * print it so a single boot log shows whether it really took.
       */

      if (getreg32(reg0 + STM32N6_ATON_RISAF_REGION_STRIDE) != 0)
        {
          stm32n6_aton_wd_puts(" | r1 cfgr=");
          stm32n6_aton_wd_hex(getreg32(reg0 +
                            STM32N6_ATON_RISAF_REGION_STRIDE));
          stm32n6_aton_wd_puts(" start=");
          stm32n6_aton_wd_hex(getreg32(reg0 +
                            STM32N6_ATON_RISAF_REGION_STRIDE + 0x04));
          stm32n6_aton_wd_puts(" end=");
          stm32n6_aton_wd_hex(getreg32(reg0 +
                            STM32N6_ATON_RISAF_REGION_STRIDE + 0x08));
          stm32n6_aton_wd_puts(" cidc=");
          stm32n6_aton_wd_hex(getreg32(reg0 +
                            STM32N6_ATON_RISAF_REGION_STRIDE + 0x0c));
        }

      stm32n6_aton_wd_puts("\r\n");
    }
}

/****************************************************************************
 * Name: stm32n6_aton_risaf_clear
 *
 * Description:
 *   Clear any stale illegal-access records so that the next fault dump shows
 *   only what actually happened in this boot.
 *
 ****************************************************************************/

static void stm32n6_aton_risaf_clear(void)
{
  static const uint32_t risaf[STM32N6_ATON_NRISAF] =
  {
    STM32N6_ATON_RISAF1_BASE, STM32N6_ATON_RISAF2_BASE,
    STM32N6_ATON_RISAF3_BASE, STM32N6_ATON_RISAF4_BASE,
    STM32N6_ATON_RISAF5_BASE, STM32N6_ATON_RISAF6_BASE,
    STM32N6_ATON_RISAF7_BASE, STM32N6_ATON_RISAF8_BASE,
    STM32N6_ATON_RISAF9_BASE, STM32N6_ATON_RISAF11_BASE,
    STM32N6_ATON_RISAF12_BASE, STM32N6_ATON_RISAF13_BASE
  };

