open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_aton_aie.c
  int i;

  for (i = 0; i < STM32N6_ATON_NRISAF; i++)
    {
      uint32_t iasr = getreg32(risaf[i] + STM32N6_ATON_RISAF_IASR);

      if (iasr != 0)
        {
          putreg32(iasr, risaf[i] + STM32N6_ATON_RISAF_IACR);
        }
    }
}

/****************************************************************************
 * Name: stm32n6_aton_watchdog
 *
 * Description:
 *   Give an in-flight inference a voice.
 *
 *   When the NPU keeps its interrupt line asserted, the CPU never returns to
 *   thread mode: the ISR completes and the NVIC takes the same interrupt
 *   again, so nothing can report and the shell just stops with no message.
 *   This thread reports the last runtime phase and the interrupt/event
 *   counters once a second, and dumps the runtime's ISR-side log as soon as
 *   the storm protection had to mask the line.
 *
 ****************************************************************************/

static void stm32n6_aton_wd_puts(FAR const char *str)
{
  while (*str != '\0')
    {
      up_putc((int)(unsigned char)*str++);
    }
}

static void stm32n6_aton_wd_u32(uint32_t value)
{
  char buf[11];
  int  n = 0;

  if (value == 0)
    {
      up_putc('0');
      return;
    }

  while (value != 0 && n < (int)sizeof(buf))
    {
      buf[n++] = (char)('0' + (value % 10));
      value   /= 10;
    }

  while (n-- > 0)
    {
      up_putc(buf[n]);
    }
}

static void stm32n6_aton_wd_hex(uint32_t value)
{
  int i;

  for (i = 28; i >= 0; i -= 4)
    {
      uint32_t nib = (value >> i) & 0xf;
      up_putc((int)(nib < 10 ? '0' + nib : 'a' + nib - 10));
    }
}

static void stm32n6_aton_wd_task(FAR struct tcb_s *tcb, FAR void *arg)
{
  UNUSED(arg);

  stm32n6_aton_wd_puts(" ");
  stm32n6_aton_wd_puts(tcb->name);
  stm32n6_aton_wd_puts(":");
  stm32n6_aton_wd_u32((uint32_t)tcb->task_state);
  stm32n6_aton_wd_puts("@");
  stm32n6_aton_wd_hex((uint32_t)(uintptr_t)tcb->waitobj);
}

static uint32_t stm32n6_aton_wd_primask(void)
{
  uint32_t value;
  __asm__ __volatile__("mrs %0, primask" : "=r"(value));
  return value;
}

static uint32_t stm32n6_aton_wd_basepri(void)
{
  uint32_t value;
  __asm__ __volatile__("mrs %0, basepri" : "=r"(value));
  return value;
}

/* Heartbeat.
 *
 * Written with polled, unbuffered up_putc() on purpose: this line has to get
 * out even when the console's interrupt driven path, its lock or the scheduler
 * are in trouble - that is exactly the situation it exists to diagnose.
 *
 * Reading:
 *   - heartbeat continues after the app went quiet -> the CPU and the tick are
 *     alive, the application (or the console path) is what stopped;
 *   - heartbeat stops -> the CPU never returns to thread mode (interrupt
 *     storm, interrupt handler stuck) or interrupts are masked - primask /
 *     basepri show which;
 *   - tick not advancing while the heartbeat runs -> the system tick is gone.
 */

/****************************************************************************
 * Name: stm32n6_aton_npu_bus_dump
 *
 * Description:
 *   Dump the NPU's bus interfaces and its AXI cache.  BUSIF0/1 latch one
 *   error bit per AXI bus port ("Errors from AXI bus related to busport N"),
 *   which is where a read that no slave answers or that the interconnect
 *   rejects shows up - the epoch controller reports neither as an interrupt.
 *   The cache status says whether the cache is idle, busy or errored, and
 *   which address range the last maintenance command covered.
 *
 ****************************************************************************/

/****************************************************************************
 * Name: stm32n6_aton_npu_clocks_on
 *
 * Description:
 *   Open every ATON clock gate (AGATES0/1 and BGATES).  The vendor runtime
 *   closes them when it is built with LL_ATON_ENABLE_CLOCK_GATING=1; our OSAL
 *   hook already reopens them at runtime init, and this is the belt-and-
 *   braces copy the watchdog repeats if the epoch loop still stalls.
 *
 ****************************************************************************/

/* Keep the NPU domain clocked while the CPU sleeps.
 *
 * This port fills in only the low-power (CSLEEP) clock enables it needs for
 * itself - bus, memories, USART1 - while RCC_AHB5LPENR resets to zero.  The
 * NPU and CACHEAXI clocks therefore stop the moment up_idle() executes WFI,
 * which is what happens a few microseconds after the epoch controller starts
 * the dataflow: the stream engines wedge mid transfer and the epoch
 * controller waits for a frame that can never finish.  The ST examples avoid
 * this by enabling every low-power clock in low_power_clock_config().
 */

static void stm32n6_aton_gate_dump(void)
{
  stm32n6_aton_wd_puts("[gate] scr=");
  stm32n6_aton_wd_hex(getreg32(0xe000ed10u));
  stm32n6_aton_wd_puts(" mscr=");
  stm32n6_aton_wd_hex(getreg32(0xe001e000u));
  stm32n6_aton_wd_puts(" icncgcr=");
  stm32n6_aton_wd_hex(getreg32(STM32_SYSCFG_BASE + 0x38));
  stm32n6_aton_wd_puts(" npuicncr=");
  stm32n6_aton_wd_hex(getreg32(STM32_SYSCFG_BASE + 0x78));
  stm32n6_aton_wd_puts(" busenr=");
  stm32n6_aton_wd_hex(getreg32(STM32_RCC_BASE + 0x244));
  stm32n6_aton_wd_puts(" miscenr=");
  stm32n6_aton_wd_hex(getreg32(STM32_RCC_BASE + 0x248));
  stm32n6_aton_wd_puts(" memenr=");
  stm32n6_aton_wd_hex(getreg32(STM32_RCC_BASE + 0x24c));
  stm32n6_aton_wd_puts(" buslpen=");
  stm32n6_aton_wd_hex(getreg32(STM32_RCC_BASE + 0x284));
  stm32n6_aton_wd_puts(" ahb5lpen=");
  stm32n6_aton_wd_hex(getreg32(STM32_RCC_BASE + 0x2a0));
  stm32n6_aton_wd_puts("\r\n");
}

static void stm32n6_aton_enable_sleep_clocks(void)
{
  static const uint32_t lpen[15] =
  {
    STM32_RCC_BASE + 0x0284,  /* BUSLPENR: ACLKN(NPU ICN) */
    STM32_RCC_BASE + 0x0288,  /* MISCLPENR (ST sets ~0 here too) */
    STM32_RCC_BASE + 0x028c,  /* MEMLPENR   */
    STM32_RCC_BASE + 0x0290,  /* AHB1LPENR  */
    STM32_RCC_BASE + 0x0294,  /* AHB2LPENR  */
    STM32_RCC_BASE + 0x0298,  /* AHB3LPENR: RISAF/RIFSC/IAC */
    STM32_RCC_BASE + 0x029c,  /* AHB4LPENR  */
    STM32_RCC_BASE + 0x02a0,  /* AHB5LPENR: NPU, CACHEAXI   */
    STM32_RCC_BASE + 0x02a4,  /* APB1LPENR1 */
    STM32_RCC_BASE + 0x02a8,  /* APB1LPENR2 */
    STM32_RCC_BASE + 0x02ac,  /* APB2LPENR  */
    STM32_RCC_BASE + 0x02b0,  /* APB3LPENR  */
    STM32_RCC_BASE + 0x02b4,  /* APB4LPENR1 */
    STM32_RCC_BASE + 0x02b8,  /* APB4LPENR2 */
    STM32_RCC_BASE + 0x02bc   /* APB5LPENR  */
  };

