open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_aton_aie.c
  int i;

  /* 15 项：BUS/MISC/MEM + AHB1..5 + APB1..5。
   * 这里曾经写成 lpen[14] 且循环 14 次，导致初始izer里第 15 个
   * APB5LPENR 被静默丢弃 —— APB5 承载 LTDC 的时钟门控。 */

  for (i = 0; i < 15; i++)
    {
      putreg32(getreg32(lpen[i]) | 0xffffffffu, lpen[i]);
    }

  stm32n6_aton_wd_puts("[sleep] bus=");
  stm32n6_aton_wd_hex(getreg32(STM32_RCC_BASE + 0x0284));
  stm32n6_aton_wd_puts(" mem=");
  stm32n6_aton_wd_hex(getreg32(STM32_RCC_BASE + 0x028c));
  stm32n6_aton_wd_puts(" ahb3=");
  stm32n6_aton_wd_hex(getreg32(STM32_RCC_BASE + 0x0298));
  stm32n6_aton_wd_puts(" ahb5=");
  stm32n6_aton_wd_hex(getreg32(STM32_RCC_BASE + 0x02a0));
  stm32n6_aton_wd_puts("\\r\\n");
}

static void stm32n6_aton_npu_clocks_on(void)
{
  putreg32(1, STM32_ATON_BLK_CLKCTRL);
  putreg32(0xffffffff, STM32_ATON_CLKCTRL_AGATES0);
  putreg32(0xffffffff, STM32_ATON_CLKCTRL_AGATES1);
  putreg32(0xffffffff, STM32_ATON_CLKCTRL_BGATES);

  stm32n6_aton_wd_puts("[npu] clocks opened: ag0=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_CLKCTRL_AGATES0));
  stm32n6_aton_wd_puts(" ag1=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_CLKCTRL_AGATES1));
  stm32n6_aton_wd_puts(" bg=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_CLKCTRL_BGATES));
  stm32n6_aton_wd_puts("\r\n");
  /* Baseline of the central stream switch, taken while the model is being
   * brought up (before any epoch runs): later dumps can then tell "never
   * configured" apart from "configured and then cleared".
   */

  stm32n6_aton_wd_puts("[switch] base ctrl=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_STRSWITCH_CTRL));
  stm32n6_aton_wd_puts(" ver=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_STRSWITCH_VERSION));
  stm32n6_aton_wd_puts(" dst0..7:");
  for (int si = 0; si < 8; si++)
    {
      stm32n6_aton_wd_puts(" ");
      stm32n6_aton_wd_hex(getreg32(STM32_ATON_STRSWITCH_DST(si)));
    }

  stm32n6_aton_wd_puts("\r\n");


  /* The NPU domain must stay clocked while the CPU idles (see above) */

  stm32n6_aton_enable_sleep_clocks();

  /* r31: MEMSYSCTL MSCR - mark both CPU caches active, exactly like the ST
   * 994 example's main() (MSCR |= ICACTIVE | DCACTIVE); the memory system
   * uses those bits to know the caches are live.
   */

  putreg32(getreg32(0xe001e000u) | (1u << 13) | (1u << 12), 0xe001e000u);
  stm32n6_aton_gate_dump();

}

/****************************************************************************
 * Name: stm32n6_aton_npu_block_dump
 *
 * Description:
 *   Print the CTRL register of every ATON unit plus the clock control unit's
 *   gates.  Each unit's CTRL bit 0 is its enable; a unit that is disabled (or
 *   clock gated) stalls the epoch controller on the opcode that needs it, and
 *   the epoch controller reports neither an error interrupt nor a counter
 *   change for that - which is exactly the shape of the current hang.
 *
 ****************************************************************************/

static void stm32n6_aton_npu_block_dump(void)
{
  static const uint32_t blk[12] =
  {
    STM32_ATON_BLK_CLKCTRL, STM32_ATON_BLK_INTCTRL,
    STM32_ATON_BLK_BUSIF0, STM32_ATON_BLK_BUSIF1,
    STM32_ATON_BLK_STRENG, STM32_ATON_BLK_CONVACC,
    STM32_ATON_BLK_DECUN, STM32_ATON_BLK_ACTIV,
    STM32_ATON_BLK_ARITH, STM32_ATON_BLK_POOL,
    STM32_ATON_BLK_RECBUF, STM32_ATON_BLK_EPOCHCTRL
  };

  static const char * const name[12] =
  {
    "clk", "int", "busif0", "busif1", "streng",
    "convacc", "decun", "activ", "arith", "pool", "recbuf", "ec"
  };

  int i;

  stm32n6_aton_wd_puts("[npu] ctrl");

  for (i = 0; i < 12; i++)
    {
      stm32n6_aton_wd_puts(" ");
      stm32n6_aton_wd_puts(name[i]);
      stm32n6_aton_wd_puts("=");
      stm32n6_aton_wd_hex(getreg32(blk[i]));
    }

  stm32n6_aton_wd_puts("\r\n");

  stm32n6_aton_wd_puts("[npu] gates ag0=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_CLKCTRL_AGATES0));
  stm32n6_aton_wd_puts(" ag1=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_CLKCTRL_AGATES1));
  stm32n6_aton_wd_puts(" bg=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_CLKCTRL_BGATES));
  stm32n6_aton_wd_puts("\r\n");
}

static void stm32n6_aton_npu_bus_dump(void)
{
  stm32n6_aton_wd_puts("[npu] xspi2 cr=");
  stm32n6_aton_wd_hex(getreg32(0x4802a000));
  stm32n6_aton_wd_puts(" sr=");
  stm32n6_aton_wd_hex(getreg32(0x4802a020));
  stm32n6_aton_wd_puts(" ccr=");
  stm32n6_aton_wd_hex(getreg32(0x4802a100));
  stm32n6_aton_wd_puts(" tcr=");
  stm32n6_aton_wd_hex(getreg32(0x4802a108));
  stm32n6_aton_wd_puts("\r\n");

  stm32n6_aton_wd_puts("[npu] busif0 ctrl=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_BUSIF0_CTRL));
  stm32n6_aton_wd_puts(" err=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_BUSIF0_ERR));
  stm32n6_aton_wd_puts(" busif1 ctrl=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_BUSIF1_CTRL));
  stm32n6_aton_wd_puts(" err=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_BUSIF1_ERR));
  stm32n6_aton_wd_puts("\r\n");

  stm32n6_aton_wd_puts("[npu] cache sr=");
  stm32n6_aton_wd_hex(getreg32(STM32_CACHEAXI_SR));
  stm32n6_aton_wd_puts(" cr1=");
  stm32n6_aton_wd_hex(getreg32(STM32_CACHEAXI_CR1));
  stm32n6_aton_wd_puts(" cr2=");
  stm32n6_aton_wd_hex(getreg32(STM32_CACHEAXI_CR2));
  stm32n6_aton_wd_puts(" cmdstart=");
  stm32n6_aton_wd_hex(getreg32(STM32_CACHEAXI_CMDRSADDRR));
  stm32n6_aton_wd_puts(" cmdend=");
  stm32n6_aton_wd_hex(getreg32(STM32_CACHEAXI_CMDREADDRR));
  stm32n6_aton_wd_puts("\r\n");
}

/****************************************************************************
 * Name: stm32n6_aton_ns_read32
 *
 * Description:
 *   Read one word the way a non-secure master would read it, by temporarily
 *   attributing the address to an SAU region.  The SAU may only be modified
 *   while disabled, so: disable, program region, enable, read, disable,
 *   release region, enable.  Region 0 (the blob window) is left alone.
 *
 ****************************************************************************/

static uint32_t stm32n6_aton_ns_read32(int region, uint32_t addr)
{
  irqstate_t flags;
  uint32_t   value;

  flags = up_irq_save();

  putreg32(0, STM32N6_ATON_SAU_CTRL);
  stm32n6_aton_sau_ns_region(region, addr, 32);
  putreg32(1, STM32N6_ATON_SAU_CTRL);

