open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_aton_aie.c
  /* The SAU only changes the security attribute the core presents on
   * the bus; it does not change where the load is served from.  With
   * the D-Cache enabled, the line the preceding secure read filled
   * would satisfy this read as well: the access never reaches the RIF,
   * and a refused configuration becomes indistinguishable from an
   * accepted one (every candidate reports the same value, so
   * nor_domain_sweep() keeps whichever it tried last).  Drop the line
   * first so the read really reaches the NOR, and drop it again
   * afterwards so a rejected value cannot stay behind and poison the
   * weight check.
   */

  up_invalidate_dcache((uintptr_t)addr & ~31u,
                       ((uintptr_t)addr & ~31u) + 32u);
  value = getreg32(addr);
  up_invalidate_dcache((uintptr_t)addr & ~31u,
                       ((uintptr_t)addr & ~31u) + 32u);

  putreg32(0, STM32N6_ATON_SAU_CTRL);
  putreg32((uint32_t)region, STM32N6_ATON_SAU_RNR);
  putreg32(0, STM32N6_ATON_SAU_RBAR);
  putreg32(0, STM32N6_ATON_SAU_RLAR);
  putreg32(1, STM32N6_ATON_SAU_CTRL);

  up_irq_restore(flags);
  return value;
}

/****************************************************************************
 * Name: stm32n6_aton_latch_report
 *
 * Description:
 *   Print which RISAF instances have an illegal access latched right now.
 *
 ****************************************************************************/

static void stm32n6_aton_latch_report(void)
{
  static const uint32_t risaf[STM32N6_ATON_NRISAF] =
  {
    STM32N6_ATON_RISAF1_BASE, STM32N6_ATON_RISAF2_BASE,
    STM32N6_ATON_RISAF3_BASE, STM32N6_ATON_RISAF4_BASE,
    STM32N6_ATON_RISAF5_BASE, STM32N6_ATON_RISAF6_BASE,
    STM32N6_ATON_RISAF7_BASE, STM32N6_ATON_RISAF8_BASE,
    STM32N6_ATON_RISAF9_BASE, STM32N6_ATON_RISAF11_BASE,
    STM32N6_ATON_RISAF12_BASE, STM32N6_ATON_RISAF13_BASE
  };

  int i;

  stm32n6_aton_wd_puts("[latch]");

  for (i = 0; i < STM32N6_ATON_NRISAF; i++)
    {
      uint32_t iasr = getreg32(risaf[i] + STM32N6_ATON_RISAF_IASR);

      if (iasr != 0)
        {
          uint32_t iaesr = getreg32(risaf[i] + STM32N6_ATON_RISAF_IAESR);
          uint32_t iaddr = getreg32(risaf[i] + STM32N6_ATON_RISAF_IADDR);

          stm32n6_aton_wd_puts(" risaf");
          stm32n6_aton_wd_u32(i < 9 ? i + 1 : 11 + (i - 9));
          stm32n6_aton_wd_puts("=");
          stm32n6_aton_wd_hex(iasr);
          stm32n6_aton_wd_puts("/");
          stm32n6_aton_wd_hex(iaddr);
          stm32n6_aton_wd_puts("/cid");
          stm32n6_aton_wd_u32(iaesr & 0x7);
          stm32n6_aton_wd_puts((iaesr & 0x20) ? "sec" : "ns");
        }
    }

  stm32n6_aton_wd_puts("\r\n");
}

/****************************************************************************
 * Name: stm32n6_aton_matrix_probe
 *
 * Description:
 *   Decide, on hardware, how RISAF answers a read it rejects: silently with
 *   zeros, or with a latched illegal access.  Both the secure and the
 *   non-secure view of the same word are read, and the latches are printed
 *   after each one, because the whole "the NPU was not denied" conclusion
 *   rests on which of the two it is.
 *
 ****************************************************************************/

static void stm32n6_aton_matrix_probe(void)
{
  static const uint32_t addrs[4] =
  {
    0x70200000UL,   /* NOR window     (RISAF12) */
    0x24200000UL,   /* NPU RAM pool   (RISAF4/5/6) */
    0x24300000UL,   /* blob window    (RISAF1/4/5/6) */
    0x243c0000UL    /* NPU cache RAM  (RISAF8) */
  };

  int i;

  for (i = 0; i < 4; i++)
    {
      stm32n6_aton_risaf_clear();
      stm32n6_aton_wd_puts("[probe] addr=0x");
      stm32n6_aton_wd_hex(addrs[i]);
      stm32n6_aton_wd_puts(" sec=");
      stm32n6_aton_wd_hex(getreg32(addrs[i]));
      stm32n6_aton_latch_report();

      stm32n6_aton_risaf_clear();
      stm32n6_aton_wd_puts("[probe] addr=0x");
      stm32n6_aton_wd_hex(addrs[i]);
      stm32n6_aton_wd_puts(" ns =");
      stm32n6_aton_wd_hex(stm32n6_aton_ns_read32(1, addrs[i]));
      stm32n6_aton_latch_report();
    }

  stm32n6_aton_risaf_clear();
}

/****************************************************************************
 * Name: stm32n6_aton_npu_state_dump
 *
 * Description:
 *   Dump the epoch controller state machine - the only window into what the
 *   NPU itself is doing while the CPU sits in aton_osal_nuttx_wfe().
 *
 *     CTRL.RUNNING (bit 31)  the epoch controller is executing the blob
 *     ADDR                   blob fetch address the runtime handed over
 *     IRQ                    latched errors (bit1 ERR_BUSPORT, bit3
 *                            ERR_START, bit4 ERR_TIMEOUT, ...)
 *     LABEL                  current epoch label
 *     BC                     blob opcode counter (advances while running)
 *     ACC                    accumulator
 *
 ****************************************************************************/

static void stm32n6_aton_npu_state_dump(void)
{
  stm32n6_aton_gate_dump();
  stm32n6_aton_wd_puts("[npu] ctrl=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_EC_CTRL));
  stm32n6_aton_wd_puts(" addr=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_EC_ADDR));
  stm32n6_aton_wd_puts(" irq=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_EC_IRQ));
  stm32n6_aton_wd_puts(" label=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_EC_LABEL));
  stm32n6_aton_wd_puts(" bc=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_EC_BC));
  stm32n6_aton_wd_puts(" acc=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_EC_ACC));
  stm32n6_aton_wd_puts(" cc=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_EC_CIDCACHE));
  stm32n6_aton_wd_puts("\r\n");
}

/* The stream engines move tensors between memory and the accelerator
 * pipeline.  CTRL says whether one was started (EN) and whether it still
 * runs; ADDR is its current address.  A running engine pointing outside the
 * model's buffers pinpoints where the dataflow is stuck.
 */

/* Host view of the central stream switch: CTRL/VERSION plus every per
 * destination routing register.  The frame start tokens that unblock the
 * stream engines come from here, so an all-zero destination register tells
 * us that the dataflow was never wired up.
 */

