open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_aton_aie.c
/* Full register file of one stream engine.  Besides CTRL/ADDR this holds the
 * frame geometry the engine needs to know when a frame is complete (FSIZE,
 * DEPTH, STRD), the engine's own error flags (IRQ: ILLCFG/FMTMM/limiters -
 * silent unless enabled in EVENT), the frame synchronization setup
 * (EVENT.FRMTRG_EN, EVENT.FRMTRG_SRC: which engine supplies the frame
 * trigger), the external sync mode (EXTSYNC) and the progress counters
 * (FCNT/LINECNT/PIXCNT) that say whether anything moved at all.
 */

static void stm32n6_aton_npu_engine_dump(int e)
{
  uintptr_t b = STM32_ATON_STRENG_CTRL(e);

  stm32n6_aton_wd_puts("[str");
  stm32n6_aton_wd_u32((uint32_t)e);
  stm32n6_aton_wd_puts("] ctrl=");
  stm32n6_aton_wd_hex(getreg32(b + 0x00));
  stm32n6_aton_wd_puts(" fsize=");
  stm32n6_aton_wd_hex(getreg32(b + 0x0c));
  stm32n6_aton_wd_puts(" depth=");
  stm32n6_aton_wd_hex(getreg32(b + 0x10));
  stm32n6_aton_wd_puts(" strd=");
  stm32n6_aton_wd_hex(getreg32(b + 0x14));
  stm32n6_aton_wd_puts(" pos=");
  stm32n6_aton_wd_hex(getreg32(b + 0x24));

  stm32n6_aton_wd_puts("\r\n[str");
  stm32n6_aton_wd_u32((uint32_t)e);
  stm32n6_aton_wd_puts("] event=");
  stm32n6_aton_wd_hex(getreg32(b + 0x28));
  stm32n6_aton_wd_puts(" irq=");
  stm32n6_aton_wd_hex(getreg32(b + 0x3c));
  stm32n6_aton_wd_puts(" extsync=");
  stm32n6_aton_wd_hex(getreg32(b + 0x4c));
  stm32n6_aton_wd_puts(" extsync2=");
  stm32n6_aton_wd_hex(getreg32(b + 0x50));
  stm32n6_aton_wd_puts(" limen=");
  stm32n6_aton_wd_hex(getreg32(b + 0x30));
  stm32n6_aton_wd_puts(" cidc=");
  stm32n6_aton_wd_hex(getreg32(b + 0x48));

  stm32n6_aton_wd_puts("\r\n[str");
  stm32n6_aton_wd_u32((uint32_t)e);
  stm32n6_aton_wd_puts("] fcnt=");
  stm32n6_aton_wd_hex(getreg32(b + 0x68));
  stm32n6_aton_wd_puts(" lcnt=");
  stm32n6_aton_wd_hex(getreg32(b + 0x64));
  stm32n6_aton_wd_puts(" pcnt=");
  stm32n6_aton_wd_hex(getreg32(b + 0x60));
  stm32n6_aton_wd_puts(" last=");
  stm32n6_aton_wd_hex(getreg32(b + 0x58));
  stm32n6_aton_wd_puts(" addr=");
  stm32n6_aton_wd_hex(getreg32(b + 0x08));
  stm32n6_aton_wd_puts(" limit=");
  stm32n6_aton_wd_hex(getreg32(b + 0x34));
  stm32n6_aton_wd_puts(" limad=");
  stm32n6_aton_wd_hex(getreg32(b + 0x38));
  stm32n6_aton_wd_puts(" frpt=");
  stm32n6_aton_wd_hex(getreg32(b + 0x1c));
  stm32n6_aton_wd_puts(" foff=");
  stm32n6_aton_wd_hex(getreg32(b + 0x18));
  stm32n6_aton_wd_puts(" dcnt=");
  stm32n6_aton_wd_hex(getreg32(b + 0x5c));
  stm32n6_aton_wd_puts("\r\n");
}

/* Compact one-line-per-engine view of where the stream engines were pointed.
 * The engine that is supposed to fetch the application's input buffer must show
 * 0x243a2000 in `last`; anything else means the registered input never entered
 * the pipeline, which is exactly what an output that ignores the frame looks
 * like from the outside.
 */

static void stm32n6_aton_streng_sweep(void)
{
  int e;

  for (e = 0; e < 10; e++)
    {
      uintptr_t b = STM32_ATON_STRENG_CTRL(e);

      stm32n6_aton_wd_puts("[strsweep] e=");
      stm32n6_aton_wd_u32((uint32_t)e);
      stm32n6_aton_wd_puts(" ctrl=");
      stm32n6_aton_wd_hex(getreg32(b + 0x00));
      stm32n6_aton_wd_puts(" addr=");
      stm32n6_aton_wd_hex(getreg32(b + 0x08));
      stm32n6_aton_wd_puts(" last=");
      stm32n6_aton_wd_hex(getreg32(b + 0x58));
      stm32n6_aton_wd_puts(" fsz=");
      stm32n6_aton_wd_hex(getreg32(b + 0x0c));
      stm32n6_aton_wd_puts(" pcnt=");
      stm32n6_aton_wd_hex(getreg32(b + 0x60));
      stm32n6_aton_wd_puts("\r\n");
    }
}

/* One compact progress sample of both running engines: pixel/frame counters,
 * the address of the last bus transaction and the engine error flags.  Taken
 * every heartbeat it separates "frozen" from "crawling", and the rate probe
 * below measures how fast it actually crawls.
 */

/* Did the NPU actually write results?  Read the model output buffer through
 * both of its aliases and the tail of what the output stream engine claims to
 * have written, so the data on the memory side can be compared with the
 * progress counters on the unit side.
 */

static void stm32n6_aton_npu_mem_dump(void)
{
  int i;

  stm32n6_aton_wd_puts("[mem] in @24340000:");
  for (i = 0; i < 4; i++)
    {
      stm32n6_aton_wd_puts(" ");
      stm32n6_aton_wd_hex(getreg32(0x24340000u + 4u * (uint32_t)i));
    }

  stm32n6_aton_wd_puts("\r\n[mem] out@34280000:");
  for (i = 0; i < 4; i++)
    {
      stm32n6_aton_wd_puts(" ");
      stm32n6_aton_wd_hex(getreg32(0x34280000u + 4u * (uint32_t)i));
    }

  stm32n6_aton_wd_puts("\r\n[mem] out@24280000:");
  for (i = 0; i < 4; i++)
    {
      stm32n6_aton_wd_puts(" ");
      stm32n6_aton_wd_hex(getreg32(0x24280000u + 4u * (uint32_t)i));
    }

  /* Around the address the output engine stopped at (0x34280000 + 0x1918) */

  stm32n6_aton_wd_puts("\r\n[mem] out@34281900:");
  for (i = 0; i < 8; i++)
    {
      stm32n6_aton_wd_puts(" ");
      stm32n6_aton_wd_hex(getreg32(0x34281900u + 4u * (uint32_t)i));
    }

  stm32n6_aton_wd_puts("\r\n");
}

/* Full arithmetic unit register file: besides the coefficients these hold
 * the address generator counters (INCCNT, RSTCNT1-3) and the coefficient
 * memory pointer (COEFFADDR) - "the address of the coeffs to be read next".
 */

static void stm32n6_aton_npu_arith_full(int n)
{
  uintptr_t b = STM32_ATON_BLK_ARITH + (uintptr_t)n * 0x1000;

  stm32n6_aton_wd_puts("[arith");
  stm32n6_aton_wd_u32((uint32_t)n);
  stm32n6_aton_wd_puts("] ctrl=");
  stm32n6_aton_wd_hex(getreg32(b + 0x00));
  stm32n6_aton_wd_puts(" sh=");
  stm32n6_aton_wd_hex(getreg32(b + 0x08));
  stm32n6_aton_wd_puts(" incc=");
  stm32n6_aton_wd_hex(getreg32(b + 0x0c));
  stm32n6_aton_wd_puts(" rst1=");
  stm32n6_aton_wd_hex(getreg32(b + 0x10));
  stm32n6_aton_wd_puts(" rst2=");
  stm32n6_aton_wd_hex(getreg32(b + 0x14));
  stm32n6_aton_wd_puts(" rst3=");
  stm32n6_aton_wd_hex(getreg32(b + 0x18));

  stm32n6_aton_wd_puts("\r\n[arith");
  stm32n6_aton_wd_u32((uint32_t)n);
  stm32n6_aton_wd_puts("] aoff=");
  stm32n6_aton_wd_hex(getreg32(b + 0x24));
  stm32n6_aton_wd_puts(" ioff=");
  stm32n6_aton_wd_hex(getreg32(b + 0x28));
  stm32n6_aton_wd_puts(" xlate=");
  stm32n6_aton_wd_hex(getreg32(b + 0x2c));
  stm32n6_aton_wd_puts(" coffa=");
  stm32n6_aton_wd_hex(getreg32(b + 0x30));
  stm32n6_aton_wd_puts(" insh=");
  stm32n6_aton_wd_hex(getreg32(b + 0x34));
  stm32n6_aton_wd_puts(" clip=");
  stm32n6_aton_wd_hex(getreg32(b + 0x38));
  stm32n6_aton_wd_puts(" ca=");
  stm32n6_aton_wd_hex(getreg32(b + 0x1c));
  stm32n6_aton_wd_puts(" cb=");
  stm32n6_aton_wd_hex(getreg32(b + 0x20));
  stm32n6_aton_wd_puts("\r\n");
}

