open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_aton_aie.c
/* Debug/trace unit: enable it and look at every register, including the one
 * at 0x18 that the header does not name.  Its stream switch link monitors
 * are the only window into which link of the dataflow fabric is blocked.
 */

static void stm32n6_aton_npu_trace_probe(void)
{
  int i;

  putreg32(1u, STM32_ATON_TRACE_CTRL);
  nxsig_usleep(200000);

  stm32n6_aton_wd_puts("[trace2] en:");
  for (i = 0; i < 16; i++)
    {
      stm32n6_aton_wd_puts(" ");
      stm32n6_aton_wd_hex(getreg32(STM32_NPU_BASE + 0x1f000u
                                   + 4u * (uint32_t)i));
    }

  stm32n6_aton_wd_puts("\r\n");
}

/* Stop the epoch controller and re-run the very same blob one micro
 * instruction at a time.  If the counter then walks past the index it is
 * stuck on, the stall is a wait for something outside the instruction
 * stream; if it stops at the same place, that micro instruction is the one
 * waiting.
 */

/* Deadlock probe: the epoch controller executes micro instructions that
 * program unit registers, and most unit registers are read-only while the
 * unit is running ("RO when CTRL.RUNNING").  If the counter does not move
 * because the controller is waiting for such a write to take effect, taking
 * the units out of their running state must make it advance again.
 *
 * So: stop both stream engines, watch the counter, clear their pipelines,
 * watch again, and finally put them back the way they were.
 */

/* Second round of pokes.
 *
 * (a) The trace unit's link monitors only count once the unit is enabled, so
 *     sample them repeatedly: the bits that change name the links that are
 *     stalling while the dataflow is frozen.
 *
 * (b) The currently frozen unit set is the four units the model uses.  Enable
 *     every other functional unit (all read CTRL == 0) in case the epoch
 *     program is waiting for one of them, and watch the counter.
 *
 * (c) Toggle the stream switch and the two bus interfaces, again watching the
 *     counter: a controller waiting for one of them would move on.
 */

static void stm32n6_aton_npu_poke2(void)
{
  static const uint32_t blk[11] =
  {
    STM32_ATON_BLK_STRENG + 0 * 0x1000,
    STM32_ATON_BLK_STRENG + 1 * 0x1000,
    STM32_ATON_BLK_STRENG + 2 * 0x1000,
    STM32_ATON_BLK_STRENG + 4 * 0x1000,
    STM32_ATON_BLK_CONVACC + 0 * 0x1000,
    STM32_ATON_BLK_DECUN + 0 * 0x1000,
    STM32_ATON_BLK_ACTIV + 0 * 0x1000,
    STM32_ATON_BLK_POOL + 0 * 0x1000,
    STM32_ATON_BLK_RECBUF,
    STM32_ATON_BLK_ARITH + 2 * 0x1000,
    STM32_ATON_BLK_ARITH + 3 * 0x1000
  };

  int i;

  /* (a) link monitor deltas */

  putreg32(1u, STM32_ATON_TRACE_CTRL);

  for (i = 0; i < 3; i++)
    {
      stm32n6_aton_wd_puts("[lnk] il=");
      stm32n6_aton_wd_hex(getreg32(STM32_ATON_TRACE_ILINK_LO));
      stm32n6_aton_wd_puts(" ih=");
      stm32n6_aton_wd_hex(getreg32(STM32_ATON_TRACE_ILINK_HI));
      stm32n6_aton_wd_puts(" ol=");
      stm32n6_aton_wd_hex(getreg32(STM32_ATON_TRACE_OLINK_LO));
      stm32n6_aton_wd_puts(" oh=");
      stm32n6_aton_wd_hex(getreg32(STM32_ATON_TRACE_OLINK_HI));
      stm32n6_aton_wd_puts("\r\n");

      nxsig_usleep(200000);
    }

  /* (b) enable the idle units */

  for (i = 0; i < 11; i++)
    {
      putreg32(1u, blk[i]);
    }

  nxsig_usleep(200000);
  stm32n6_aton_wd_puts("[poke2] units enabled, bc=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_EC_BC));
  stm32n6_aton_wd_puts(" irq=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_EC_IRQ));
  stm32n6_aton_wd_puts("\r\n");

  /* (c) switch and bus interfaces */

  putreg32(0, STM32_ATON_STRSWITCH_CTRL);
  nxsig_usleep(200000);
  stm32n6_aton_wd_puts("[poke2] switch off, bc=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_EC_BC));
  stm32n6_aton_wd_puts("\r\n");

  putreg32(1u, STM32_ATON_STRSWITCH_CTRL);
  nxsig_usleep(200000);
  stm32n6_aton_wd_puts("[poke2] switch on, bc=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_EC_BC));
  stm32n6_aton_wd_puts(" dst9=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_STRSWITCH_DST(9)));
  stm32n6_aton_wd_puts(" dst28=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_STRSWITCH_DST(28)));
  stm32n6_aton_wd_puts("\r\n");
}

static void stm32n6_aton_npu_deadlock_probe(void)
{
  static const int units[4] =
  {
    STM32_ATON_BLK_STRENG + 3 * 0x1000,   /* input stream engine  */
    STM32_ATON_BLK_STRENG + 9 * 0x1000,   /* output stream engine */
    STM32_ATON_BLK_ARITH + 0,             /* arithmetic slice 0   */
    STM32_ATON_BLK_ARITH + 0x1000         /* arithmetic slice 1   */
  };

  int i;

  for (i = 0; i < 4; i++)
    {
      uint32_t before = getreg32(STM32_ATON_EC_BC);

      stm32n6_aton_wd_puts("[poke] unit=");
      stm32n6_aton_wd_hex((uint32_t)(units[i] - STM32_NPU_BASE));
      stm32n6_aton_wd_puts(" ctrl=");
      stm32n6_aton_wd_hex(getreg32(units[i]));
      stm32n6_aton_wd_puts(" bc=");
      stm32n6_aton_wd_hex(before);

      putreg32(0, units[i]);
      nxsig_usleep(100000);

      stm32n6_aton_wd_puts(" -> bc=");
      stm32n6_aton_wd_hex(getreg32(STM32_ATON_EC_BC));
      stm32n6_aton_wd_puts(" ecctrl=");
      stm32n6_aton_wd_hex(getreg32(STM32_ATON_EC_CTRL));
      stm32n6_aton_wd_puts(" ecirq=");
      stm32n6_aton_wd_hex(getreg32(STM32_ATON_EC_IRQ));
      stm32n6_aton_wd_puts("\r\n");
    }
}

static void stm32n6_aton_npu_step_probe(void)
{
  int i;

  putreg32(0, STM32_ATON_EC_CTRL);
  stm32n6_aton_wd_puts("[step] stop ctrl=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_EC_CTRL));
  stm32n6_aton_wd_puts(" irq=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_EC_IRQ));
  stm32n6_aton_wd_puts(" bc=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_EC_BC));

  putreg32(0, STM32_ATON_EC_IRQ);

  /* SM (step mode) = bit 3, EN = bit 0; ADDR still points at the blob */

  putreg32(1u | (1u << 3), STM32_ATON_EC_CTRL);
  stm32n6_aton_wd_puts("\r\n[step] armed ctrl=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_EC_CTRL));
  stm32n6_aton_wd_puts(" addr=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_EC_ADDR));

  for (i = 0; i < 64; i++)
    {
      putreg32(1u << 16, STM32_ATON_EC_IRQ);

      if ((i % 8) == 7)
        {
          stm32n6_aton_wd_puts("\r\n[step] i=");
          stm32n6_aton_wd_u32((uint32_t)(i + 1));
          stm32n6_aton_wd_puts(" bc=");
          stm32n6_aton_wd_hex(getreg32(STM32_ATON_EC_BC));
          stm32n6_aton_wd_puts(" irq=");
          stm32n6_aton_wd_hex(getreg32(STM32_ATON_EC_IRQ));
        }
    }

  stm32n6_aton_wd_puts("\r\n");
}

static void stm32n6_aton_npu_progress_puts(int e)
{
  uintptr_t b = STM32_ATON_STRENG_CTRL(e);

  stm32n6_aton_wd_puts(" s");
  stm32n6_aton_wd_u32((uint32_t)e);
  stm32n6_aton_wd_puts("=");
  stm32n6_aton_wd_hex(getreg32(b + 0x60));
  stm32n6_aton_wd_puts("/");
  stm32n6_aton_wd_hex(getreg32(b + 0x58));
  stm32n6_aton_wd_puts("/");
  stm32n6_aton_wd_hex(getreg32(b + 0x68));
  stm32n6_aton_wd_puts("/");
  stm32n6_aton_wd_hex(getreg32(b + 0x3c));
}

