open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_aton_aie.c
static void stm32n6_aton_npu_progress_dump(void)
{
  stm32n6_aton_wd_puts("[prog] bc=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_EC_BC));
  stm32n6_aton_npu_progress_puts(3);
  stm32n6_aton_npu_progress_puts(9);
  stm32n6_aton_wd_puts("\r\n");
}

/* Rate probe: clear the engine error flags, then take three samples a fixed
 * delay apart.  The pixel counter deltas give the dataflow throughput in
 * pixels per sample window - a trickle points at a bandwith/throttle limit,
 * a standstill at a blocked (or dead) unit.
 */

static void stm32n6_aton_npu_rate_probe(void)
{
  int i;

  /* Acknowledge the flags we saw so that only new events show up again */

  putreg32(getreg32(STM32_ATON_STRENG_CTRL(3) + 0x3c),
           STM32_ATON_STRENG_CTRL(3) + 0x3c);
  putreg32(getreg32(STM32_ATON_STRENG_CTRL(9) + 0x3c),
           STM32_ATON_STRENG_CTRL(9) + 0x3c);

  for (i = 0; i < 3; i++)
    {
      stm32n6_aton_wd_puts("[rate]");
      stm32n6_aton_npu_progress_puts(3);
      stm32n6_aton_npu_progress_puts(9);
      stm32n6_aton_wd_puts("\r\n");

      nxsig_usleep(300000);
    }
}

/* Arithmetic unit registers: the two slices that the epoch program wired
 * between the input and the output stream engine.
 */

static void stm32n6_aton_npu_arith_dump(int n)
{
  uintptr_t b = STM32_ATON_BLK_ARITH + (uintptr_t)n * 0x1000;

  stm32n6_aton_wd_puts("[arith");
  stm32n6_aton_wd_u32((uint32_t)n);
  stm32n6_aton_wd_puts("] ctrl=");
  stm32n6_aton_wd_hex(getreg32(b + 0x00));
  stm32n6_aton_wd_puts(" shift=");
  stm32n6_aton_wd_hex(getreg32(b + 0x08));
  stm32n6_aton_wd_puts(" inccnt=");
  stm32n6_aton_wd_hex(getreg32(b + 0x0c));
  stm32n6_aton_wd_puts(" cA=");
  stm32n6_aton_wd_hex(getreg32(b + 0x1c));
  stm32n6_aton_wd_puts(" cB=");
  stm32n6_aton_wd_hex(getreg32(b + 0x20));
  stm32n6_aton_wd_puts(" xlate=");
  stm32n6_aton_wd_hex(getreg32(b + 0x2c));
  stm32n6_aton_wd_puts(" coffa=");
  stm32n6_aton_wd_hex(getreg32(b + 0x30));
  stm32n6_aton_wd_puts(" insh=");
  stm32n6_aton_wd_hex(getreg32(b + 0x34));
  stm32n6_aton_wd_puts(" clip=");
  stm32n6_aton_wd_hex(getreg32(b + 0x38));
  stm32n6_aton_wd_puts("\r\n");
}

static void stm32n6_aton_npu_switch_dump(void)
{
  uint32_t ctrl = getreg32(STM32_ATON_STRSWITCH_CTRL);
  int      i;

  stm32n6_aton_wd_puts("[switch] ctrl=");
  stm32n6_aton_wd_hex(ctrl);
  stm32n6_aton_wd_puts(" ver=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_STRSWITCH_VERSION));

  stm32n6_aton_wd_puts("\r\n[switch] dst:");
  for (i = 0; i < STM32_ATON_STRSWITCH_NDST; i++)
    {
      stm32n6_aton_wd_puts(" ");
      stm32n6_aton_wd_hex(getreg32(STM32_ATON_STRSWITCH_DST(i)));
    }

  stm32n6_aton_wd_puts("\r\n");

  /* CTRL.EN gates the whole switch: with it cleared no frame start can be
   * generated and every stream engine stalls in "wait for frame start".
   * Turn it on (and say so) so the next heartbeats show whether that alone
   * sets the dataflow in motion.
   */

  if ((ctrl & 1u) == 0)
    {
      putreg32(ctrl | 1u, STM32_ATON_STRSWITCH_CTRL);
      stm32n6_aton_wd_puts("[switch] EN was 0 -> set to 1, ctrl now=");
      stm32n6_aton_wd_hex(getreg32(STM32_ATON_STRSWITCH_CTRL));
      stm32n6_aton_wd_puts("\r\n");
    }
}

static void stm32n6_aton_npu_streng_dump(void)
{
  int i;

  stm32n6_aton_wd_puts("[streng] ctrl:");
  for (i = 0; i < STM32_ATON_NSTRENG; i++)
    {
      stm32n6_aton_wd_puts(" ");
      stm32n6_aton_wd_hex(getreg32(STM32_ATON_STRENG_CTRL(i)));
    }

  stm32n6_aton_wd_puts("\r\n[streng] addr:");
  for (i = 0; i < STM32_ATON_NSTRENG; i++)
    {
      stm32n6_aton_wd_puts(" ");
      stm32n6_aton_wd_hex(getreg32(STM32_ATON_STRENG_ADDR(i)));
    }

  stm32n6_aton_wd_puts("\r\n");
}

/* Which unit currently asks for attention (the host reads INTREG to find
 * out), how the runtime routed unit interrupts, and what the debug/trace
 * unit sees on the stream switch links.
 */

static void stm32n6_aton_npu_irq_trace_dump(void)
{
  stm32n6_aton_wd_puts("[int] intreg=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_INTCTRL_INTREG));
  stm32n6_aton_wd_puts(" or0=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_INTCTRL_ORMSK0));
  stm32n6_aton_wd_puts(" or1=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_INTCTRL_ORMSK1));
  stm32n6_aton_wd_puts(" and0=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_INTCTRL_ANDMSK0));
  stm32n6_aton_wd_puts(" and1=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_INTCTRL_ANDMSK1));
  stm32n6_aton_wd_puts("\r\n");

  stm32n6_aton_wd_puts("[trace] ctrl=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_TRACE_CTRL));
  stm32n6_aton_wd_puts(" il=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_TRACE_ILINK_LO));
  stm32n6_aton_wd_puts(" ih=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_TRACE_ILINK_HI));
  stm32n6_aton_wd_puts(" ol=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_TRACE_OLINK_LO));
  stm32n6_aton_wd_puts(" oh=");
  stm32n6_aton_wd_hex(getreg32(STM32_ATON_TRACE_OLINK_HI));
  stm32n6_aton_wd_puts("\r\n");
}

/* The epoch controller executes micro instructions directly out of the blob
 * at ADDR and BC counts its way through that image: dump the header and the
 * words around BC, so the blocking micro instruction can be looked at.
 */

static void stm32n6_aton_npu_blob_dump(void)
{
  uint32_t base = (uint32_t)getreg32(STM32_ATON_EC_ADDR);
  uint32_t bc   = (uint32_t)getreg32(STM32_ATON_EC_BC);
  uint32_t idx;
  int      i;

  /* Read the program through a fresh cache state: a stale D-cache line looks
   * like garbage that is not actually in RAM.
   */

  /* r60: EC_ADDR reads back as zero once the runtime has de-initialised, and
   * the r59 log ended in a precise bus fault (CFSR 0x8200, BFAR 0x4) because
   * this dump then dereferenced address zero.  Only touch memory that really
   * lies inside the blob window; anything else is reported and skipped.
   */

  if (base < STM32N6_ATON_NS_WINDOW_BASE ||
      base >= STM32N6_ATON_NS_WINDOW_BASE + STM32N6_ATON_NS_WINDOW_SIZE)
    {
      stm32n6_aton_wd_puts("[blob] base=0x");
      stm32n6_aton_wd_hex(base);
      stm32n6_aton_wd_puts(" (outside the blob window, dump skipped)\r\n");
      return;
    }

  /* The BC-relative reads must stay inside the window as well. */

  if (4u * (bc * 2u + 8u) >
      STM32N6_ATON_NS_WINDOW_BASE + STM32N6_ATON_NS_WINDOW_SIZE - base)
    {
      stm32n6_aton_wd_puts("[blob] base=0x");
      stm32n6_aton_wd_hex(base);
      stm32n6_aton_wd_puts(" bc=0x");
      stm32n6_aton_wd_hex(bc);
      stm32n6_aton_wd_puts(" (bc beyond the window, word dump skipped)\r\n");
      return;
    }

  up_invalidate_dcache((uintptr_t)base, (uintptr_t)base + 64);

