open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_aton_aie.c
  stm32n6_aton_wd_puts("[blob] base=");
  stm32n6_aton_wd_hex(base);
  stm32n6_aton_wd_puts(" bc=");
  stm32n6_aton_wd_hex(bc);
  stm32n6_aton_wd_puts(" hdr:");
  for (i = 0; i < 4; i++)
    {
      stm32n6_aton_wd_puts(" ");
      stm32n6_aton_wd_hex(getreg32(base + 4u * (uint32_t)i));
    }

  /* Words around the counter, read as 32 bit words and as the 64 bit lines
   * the epoch controller fetches (the counter may count either of them).
   */

  stm32n6_aton_wd_puts("\r\n[blob] w32:");
  for (i = -2; i <= 3; i++)
    {
      idx = (uint32_t)((int32_t)bc + i);
      stm32n6_aton_wd_puts(" ");
      stm32n6_aton_wd_hex(getreg32(base + 4u * idx));
    }

  stm32n6_aton_wd_puts("\r\n[blob] w64:");
  for (i = 0; i < 6; i++)
    {
      idx = bc * 2u + (uint32_t)i;
      stm32n6_aton_wd_puts(" ");
      stm32n6_aton_wd_hex(getreg32(base + 4u * idx));
    }

  stm32n6_aton_wd_puts("\r\n");
}

static int stm32n6_aton_watchdog(int argc, FAR char *argv[])
{
  bool dumped = false;
  uint32_t last_bc = 0;
  int  stall_samples = 0;

  UNUSED(argc);
  UNUSED(argv);

  for (;;)
    {
      int ret = nxsig_usleep(ATON_WD_PERIOD_US);
      if (ret < 0)
        {
          /* Never turn a failed sleep into a busy loop */

          sched_yield();
        }

      if (aton_model_storm_masked() && !dumped)
        {
          dumped = true;

          _err("ERROR: NPU interrupt line masked (interrupt storm); "
               "inference will not complete. Runtime log follows:\n");
          aton_model_dump_log();
          stm32n6_aton_rif_fault_dump();
        }

      /* Between runs the NPU is idle, so the two-second heartbeat, the NPU
       * register dump and the task list are pure noise - and they cost UART
       * bandwidth right where the next run wants it.  Talk only while a run is
       * in flight, or once a storm has been detected.
       */

      if (!g_aton_run_active && !aton_model_storm_masked())
        {
          continue;
        }

      stm32n6_aton_wd_puts("[aton_wd] tick=");
      stm32n6_aton_wd_u32((uint32_t)clock_systime_ticks());
      stm32n6_aton_wd_puts(" run=");
      stm32n6_aton_wd_u32(g_aton_run_active ? 1 : 0);
      stm32n6_aton_wd_puts(" irq=");
      stm32n6_aton_wd_u32(aton_model_irq_count());
      stm32n6_aton_wd_puts(" stage=");
      stm32n6_aton_wd_u32((uint32_t)aton_model_stage());
      stm32n6_aton_wd_puts(" storm=");
      stm32n6_aton_wd_u32(aton_model_storm_masked() ? 1 : 0);
      stm32n6_aton_wd_puts(" primask=");
      stm32n6_aton_wd_u32(stm32n6_aton_wd_primask());
      stm32n6_aton_wd_puts(" basepri=");
      stm32n6_aton_wd_u32(stm32n6_aton_wd_basepri());
      stm32n6_aton_wd_puts("\r\n");

      /* While the runtime waits for the NPU, ask the NPU itself.  RUNNING
       * says whether it ever started, ADDR which blob it was pointed at,
       * BC whether it is making progress, IRQ what it complained about.
       */

      if (aton_model_stage() == STM32N6_ATON_STAGE_WFE)
        {
          uint32_t bc = (uint32_t)getreg32(STM32_ATON_EC_BC);

          /* Progress watchdog: BC (the blob opcode counter) advancing means the
           * epoch controller is working - the runtime is simply waiting for the
           * next NPU event, which is what every healthy run looks like.  Only a
           * BC that stops moving is a stall, and only then is the intrusive
           * half of the diagnostics worth its cost.
           */

          if (bc == last_bc)
            {
              stall_samples++;
            }
          else
            {
              stall_samples = 0;
            }

          last_bc = bc;

          /* Cheap, non-intrusive view, once per sample. */

          stm32n6_aton_npu_progress_dump();
          stm32n6_aton_npu_state_dump();
          stm32n6_aton_npu_bus_dump();
          stm32n6_aton_npu_block_dump();

          /* r60: the intrusive dump (it pokes unit registers and dereferences
           * EC_ADDR) used to run on the first WFE sample of every run.  That
           * flooded the log during healthy inferences, disturbed the units and
           * - with EC_ADDR cleared after a finished run - ended the r59 log in
           * a precise bus fault (BFAR = 0x4).  Now it needs a real stall.
           */

          if (stall_samples >= STM32N6_ATON_STALL_SAMPLES && !dumped)
            {
              dumped = true;

              stm32n6_aton_npu_clocks_on();
              stm32n6_aton_npu_streng_dump();
              stm32n6_aton_npu_mem_dump();
              stm32n6_aton_npu_rate_probe();
              stm32n6_aton_npu_engine_dump(3);
              stm32n6_aton_npu_engine_dump(9);
              stm32n6_aton_npu_arith_full(0);
              stm32n6_aton_npu_arith_full(1);
              stm32n6_aton_npu_switch_dump();
              stm32n6_aton_npu_deadlock_probe();
              stm32n6_aton_npu_poke2();
              stm32n6_aton_npu_irq_trace_dump();
              stm32n6_aton_npu_blob_dump();
              stm32n6_aton_risaf_xspi_dump();
              stm32n6_aton_rif_fault_dump();
                        }
        }

      /* Task states and the console transmitter state: together they say
       * whether the application is blocked (and on what) or still running,
       * and whether the console TX path is the thing that stopped.
       */

      stm32n6_aton_wd_puts("[tasks]");
      nxsched_foreach(stm32n6_aton_wd_task, NULL);
      stm32n6_aton_wd_puts("\r\n");

      /* A lost console wakeup cannot be reported by the console itself: the
       * serial driver's TX interrupt is re-armed from here (see
       * stm32n6_serial.c) and its transmitter state is printed with the raw
       * channel, so a shell that went quiet can be told apart from a system
       * that stopped running.
       */

      stm32n6_console_unstick();
      stm32n6_console_dump();

      if (g_aton_run_active)
        {
          aton_model_report("running");
        }
    }

  return OK;
}

/****************************************************************************
 * Name: stm32n6_aton_publish_model
 *
 * Description:
 *   Register the buffer the application fills for slot id and publish that
 *   slot's epoch program.
 *
 *   The order is not negotiable.  The program carries the input address as a
 *   relocation entry that ec_reloc() resolves once, while the program is
 *   published; a buffer registered afterwards never reaches the engines, and
 *   the symptom is an inference that returns a plausible answer forever while
 *   ignoring every frame (r56 lost an afternoon to exactly that).
 *
 *   Each model has its own loader - the generated symbol carries the model
 *   suffix - and the generated NN_Interface_<suffix> object holds a pointer to
 *   it, so the call goes through aton_model_publish() instead of naming one
 *   model's loader from here.
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure.
 *
 ****************************************************************************/

static int
stm32n6_aton_publish_model(FAR struct stm32n6_aton_lowerhalf_s *priv, int id)
{
  FAR struct stm32n6_aton_model_s *m = &priv->model[id];
  uint32_t in_len  = aton_model_input_len(id);
  uint32_t out_len = aton_model_output_len(id);
  int ret;

  /* A model whose tensor does not fit the shared buffer would be published
   * with an address that partly overlaps whatever comes next in the window,
   * and the engines would read that.  Refuse it here, at init, instead of
   * letting it produce wrong answers later.
   */

  if (in_len > STM32N6_ATON_APP_INPUT_SIZE)
    {
      _err("ERROR: ATON model %d needs %lu bytes of input but the shared "
           "buffer holds %u\n", id, (unsigned long)in_len,
           (unsigned)STM32N6_ATON_APP_INPUT_SIZE);
      return -ENOMEM;
    }

