open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_aton_aie.c
  ret = aton_model_set_input_buffer(id,
                                    (FAR void *)STM32N6_ATON_APP_INPUT_BASE,
                                    in_len);
  if (ret < 0)
    {
      _err("ERROR: ATON model %d rejected the input buffer: %d\n", id, ret);
      return ret;
    }

  m->input_addr  = STM32N6_ATON_APP_INPUT_BASE;
  m->input_size  = in_len;
  m->output_size = out_len;
  m->output_addr = (uint32_t)aton_model_output_addr(id);

  stm32n6_aton_wd_puts("[in] model ");
  stm32n6_aton_wd_u32((uint32_t)id);
  stm32n6_aton_wd_puts(" register 0x");
  stm32n6_aton_wd_hex(m->input_addr);
  stm32n6_aton_wd_puts(" len=");
  stm32n6_aton_wd_u32(in_len);
  stm32n6_aton_wd_puts(" program_uses=");
  stm32n6_aton_wd_hex((uint32_t)aton_model_input_pointer(id));
  stm32n6_aton_wd_puts("\r\n");

  /* Publish: the loader reads the blob out of .nsblob, so the relocated
   * copies have to be in RAM already - aton_model_blob_sync() ran above.
   */

  ret = aton_model_publish(id);
  m->published = (ret == OK);

  stm32n6_aton_wd_puts("[ec] model ");
  stm32n6_aton_wd_u32((uint32_t)id);
  stm32n6_aton_wd_puts(" publish=");
  stm32n6_aton_wd_u32(m->published ? 1 : 0);
  stm32n6_aton_wd_puts("\r\n");

  return ret;
}

/****************************************************************************
 * Name: stm32n6_aton_aie_init
 *
 * Description:
 *   Start a session (AIE_CMD_LOAD): relocate the secondary blobs into the
 *   non-secure window, initialise the ATON runtime, register the input buffer
 *   the application fills, publish the epoch program and make sure the NPU
 *   sees it in RAM.
 *
 * Returned Value:
 *   The per-session context (the lower-half instance) on success; NULL if the
 *   session could not be started.
 *
 ****************************************************************************/

static FAR void *stm32n6_aton_aie_init(FAR struct aie_lowerhalf_s *lower,
                                       uintptr_t model)
{
  FAR struct stm32n6_aton_lowerhalf_s *priv =
    (FAR struct stm32n6_aton_lowerhalf_s *)lower;
  int  ret;
  int  i;

  /* The model is linked into the image (the ATON runtime is bound to it at
   * build time), so the loader argument is not used.
   */

  UNUSED(model);

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return NULL;
    }

  if (priv->opened)
    {
      nxmutex_unlock(&priv->lock);
      return NULL;
    }

  /* The secondary blobs (everything except the program the epoch controller
   * executes) have to be reachable by the NPU, which cannot see the secure
   * SRAM images: aton_model_blob_sync() copies them into the non-secure
   * window and returns the checksum of what it copied.
   */

  stm32n6_aton_wd_puts("[nsblob] secondary blobs -> 0x");
  stm32n6_aton_wd_hex(STM32N6_ATON_NS_WINDOW_BASE);
  stm32n6_aton_wd_puts("..");
  stm32n6_aton_wd_hex(STM32N6_ATON_NS_WINDOW_BASE +
                      STM32N6_ATON_NS_WINDOW_SIZE);
  stm32n6_aton_wd_puts(" sum=");
  stm32n6_aton_wd_hex(aton_model_blob_sync(ATON_MODEL_PRIMARY));
#if defined(CONFIG_AI_ATON_MODEL_EYE)
  stm32n6_aton_wd_puts(" face=");
  stm32n6_aton_wd_hex(aton_model_blob_sync(ATON_MODEL_FACE));
#endif
  stm32n6_aton_wd_puts(" models=");
  stm32n6_aton_wd_u32((uint32_t)ATON_MODEL_NMODELS);
  stm32n6_aton_wd_puts("\r\n");

  /* The blobs and the application's input buffer share the non-secure window,
   * and nothing in the link checks one against the other: a blob that grew
   * into the buffer would be overwritten by the frame, and the symptom is a
   * program that still runs but reads nonsense.  94% of the window is spoken
   * for, so say so here rather than debug it from a wrong answer.
   */

  if ((uintptr_t)_snsblob + STM32N6_ATON_NS_BLOB_SIZE >
      STM32N6_ATON_APP_INPUT_BASE)
    {
      _err("ERROR: .nsblob ends at 0x%08lx, past the input buffer at "
           "0x%08x\n",
           (unsigned long)((uintptr_t)_snsblob + STM32N6_ATON_NS_BLOB_SIZE),
           (unsigned)STM32N6_ATON_APP_INPUT_BASE);
      nxmutex_unlock(&priv->lock);
      return NULL;
    }

  ret = aton_model_init(ATON_MODEL_PRIMARY);
  if (ret < 0)
    {
      nxmutex_unlock(&priv->lock);
      return NULL;
    }

#if defined(CONFIG_AI_ATON_MODEL_EYE)
  /* Bring the second model up here as well.  Its tables are read for the
   * first time at this instant, so a binding that lost its network - the
   * failure mode that costs an afternoon when it only shows up as a wrong
   * answer - becomes a boot-time error instead.
   */

  ret = aton_model_init(ATON_MODEL_FACE);
  if (ret < 0)
    {
      nxmutex_unlock(&priv->lock);
      return NULL;
    }
#endif

  aton_osal_nuttx_init();

  /* Every slot gets its input buffer registered and its program published,
   * in that order (see stm32n6_aton_publish_model).
   */

  ret = stm32n6_aton_publish_model(priv, ATON_MODEL_PRIMARY);
  if (ret < 0)
    {
      nxmutex_unlock(&priv->lock);
      return NULL;
    }

#if defined(CONFIG_AI_ATON_MODEL_EYE)
  ret = stm32n6_aton_publish_model(priv, ATON_MODEL_FACE);
  if (ret < 0)
    {
      nxmutex_unlock(&priv->lock);
      return NULL;
    }
#endif

  /* The NPU is not coherent with the CPU data cache: clean the freshly
   * written blobs out to RAM and drop the stale line for the loader word
   * before the epoch controller fetches them.
   *
   * STM32N6_ATON_NS_BLOB_SIZE is the size of the .nsblob section (0x7620 as
   * reported by the map file).
   */

  up_clean_dcache((uintptr_t)_snsblob,
                  (uintptr_t)_snsblob + STM32N6_ATON_NS_BLOB_SIZE);
  up_invalidate_dcache((uintptr_t)_snsblob, (uintptr_t)_snsblob + 32);

  /* The loader word and the program header: the four-byte loader field is 1
   * once the program was accepted, and the header words identify the blob.
   */

  stm32n6_aton_wd_puts("[blob-pre] img:");
  for (i = 0; i < 8; i++)
    {
      stm32n6_aton_wd_puts(" ");
      stm32n6_aton_wd_hex(getreg32((uint32_t)(uintptr_t)_snsblob +
                                   4u * (uint32_t)i));
    }

  stm32n6_aton_wd_puts("\r\n");

  /* One watchdog for the whole system: it is started with the first session
   * and lives in the KDMMY (kernel) TCB, so it survives the application.
   */

  if (!g_aton_wd_started)
    {
      g_aton_wd_started = true;

