open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_aton_aie.c
      ret = kthread_create("aton_wd", ATON_WD_PRIORITY, ATON_WD_STACKSIZE,
                           stm32n6_aton_watchdog, NULL);
      if (ret < 0)
        {
          _err("ERROR: failed to start ATON watchdog: %d\n", ret);
        }
    }

  priv->opened = true;

  nxmutex_unlock(&priv->lock);

  return lower;
}

/****************************************************************************
 * Name: stm32n6_aton_aie_deinit
 *
 * Description:
 *   End a session (close of the AIE device).  The runtime is left loaded: the
 *   epoch program and the relocated blobs stay in the non-secure window, so a
 *   later session only has to start the epoch loop again.
 *
 ****************************************************************************/

static int stm32n6_aton_aie_deinit(FAR struct aie_lowerhalf_s *lower,
                                   FAR void *context)
{
  FAR struct stm32n6_aton_lowerhalf_s *priv =
    (FAR struct stm32n6_aton_lowerhalf_s *)lower;
  int ret;

  UNUSED(context);

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  priv->opened = false;

  nxmutex_unlock(&priv->lock);

  return OK;
}

/****************************************************************************
 * Name: stm32n6_aton_aie_feed_input
 *
 * Description:
 *   Run one inference (AIE_CMD_FEED_INPUT).  The argument is a
 *   struct stm32n6_aton_invoke_params carrying the input and output buffers;
 *   the duration, run and event counters are returned in the same block.
 *
 *   The per-run diagnostics (blob header, RISAF latches, the pointer the
 *   program really uses, the strength register sweep) are what turned the
 *   "every frame gives the same answer" mystery into a one-line answer, so
 *   they stay in the log at this level of detail.
 *
 ****************************************************************************/

static int stm32n6_aton_aie_feed_input(FAR struct aie_lowerhalf_s *lower,
                                       FAR void *context, uintptr_t input)
{
  FAR struct stm32n6_aton_lowerhalf_s *priv =
    (FAR struct stm32n6_aton_lowerhalf_s *)lower;
  FAR struct stm32n6_aton_invoke_params *params;
  FAR struct stm32n6_aton_model_s *m;
  int id;
  int ret = OK;
  int i;

  UNUSED(context);

  if (input == 0)
    {
      return -EINVAL;
    }

  params = (FAR struct stm32n6_aton_invoke_params *)(uintptr_t)input;

  if (params->input == NULL || params->output == NULL)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  if (!priv->opened)
    {
      nxmutex_unlock(&priv->lock);
      return -EPERM;
    }

  /* Which model this run is for.  A caller that leaves the field at zero gets
   * the primary model, which is what a caller written against the one-model
   * driver expects.  A build without the second model answers -ENODEV rather
   * than quietly running the first one: a caller that asked for the face
   * detector and got eye classifications would otherwise never find out.
   */

  id = (int)params->model_id;

  if (id < 0 || id >= ATON_MODEL_NMODELS)
    {
      nxmutex_unlock(&priv->lock);
      return -ENODEV;
    }

  m = &priv->model[id];

  if (!m->published)
    {
      nxmutex_unlock(&priv->lock);
      return -ENODEV;
    }

  /* The epoch controller reads the program straight out of the .nsblob
   * section; a stale D-cache line would show words that are not in RAM, so
   * the header is read through a fresh cache state.
   */

  g_aton_perf_c0 = stm32n6_aton_cyccnt();

  up_invalidate_dcache((uintptr_t)_snsblob, (uintptr_t)_snsblob + 32);

  if (g_aton_perf_diag)
    {
      stm32n6_aton_wd_puts("[blob-run] img:");
      for (i = 0; i < 8; i++)
        {
          stm32n6_aton_wd_puts(" ");
          stm32n6_aton_wd_hex(getreg32((uint32_t)(uintptr_t)_snsblob +
                                       4u * (uint32_t)i));
        }

      stm32n6_aton_wd_puts("\r\n");
    }

  /* Old latches would be read back as if this run had produced them. */

  stm32n6_aton_risaf_clear();

  g_aton_run_active = true;
  g_aton_perf_c1 = stm32n6_aton_cyccnt();

  /* r79: the pointer below only reaches the engines when it is the address
   * the program was published with - ec_reloc() resolved that one once.  A
   * caller that filled some other buffer gets the same output for every
   * frame, with nothing anywhere reporting an error, so name it once.
   */

  if (params->input != (FAR const void *)m->input_addr && !m->warned)
    {
      m->warned = true;
      stm32n6_aton_wd_puts("[in] WARNING: model ");
      stm32n6_aton_wd_u32((uint32_t)id);
      stm32n6_aton_wd_puts(" is fed 0x");
      stm32n6_aton_wd_hex((uint32_t)(uintptr_t)params->input);
      stm32n6_aton_wd_puts(" but its program reads 0x");
      stm32n6_aton_wd_hex(m->input_addr);
      stm32n6_aton_wd_puts(" - that data never reaches the NPU\r\n");
    }

  ret = aton_model_run(id, params->input, params->output, &m->last_usec);

  g_aton_perf_c2 = stm32n6_aton_cyccnt();
  g_aton_run_active = false;

  if (g_aton_perf_diag)
    {
      stm32n6_aton_wd_puts("[risaf-run] latches after the run:\r\n");
      stm32n6_aton_rif_fault_dump();

      stm32n6_aton_wd_puts("[in] app=");
      stm32n6_aton_wd_hex((uint32_t)(uintptr_t)params->input);
      stm32n6_aton_wd_puts(" program_uses=");
      stm32n6_aton_wd_hex((uint32_t)aton_model_input_pointer(ATON_MODEL_PRIMARY));
      stm32n6_aton_wd_puts(" table_pointer_at=0x");
      stm32n6_aton_wd_hex((uint32_t)aton_model_input_registered(ATON_MODEL_PRIMARY));
      stm32n6_aton_wd_puts("\r\n");

      stm32n6_aton_streng_sweep();
    }

  g_aton_perf_c3 = stm32n6_aton_cyccnt();

  /* Where the time actually goes.  The NPU phase is measured by the model
   * layer in microseconds; the two CPU phases (blob snapshot and cache
   * maintenance, then the RISAF/bookkeeping reads) are usually below one tick
   * of the system timer, which is why they are counted in DWT cycles.
   */

  stm32n6_aton_wd_puts("[perf] prep=");
  stm32n6_aton_wd_hex(g_aton_perf_c1 - g_aton_perf_c0);
  stm32n6_aton_wd_puts("cyc npu=");
  stm32n6_aton_wd_hex(g_aton_perf_c2 - g_aton_perf_c1);
  stm32n6_aton_wd_puts("cyc/");
  stm32n6_aton_wd_u32(m->last_usec);
  stm32n6_aton_wd_puts("us post=");
  stm32n6_aton_wd_hex(g_aton_perf_c3 - g_aton_perf_c2);
  stm32n6_aton_wd_puts("cyc\r\n");

  priv->events = aton_model_irq_count();
  m->runs      = aton_model_runs(id);

