open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_aton_aie.c
  aton_model_report("run finished");

  if (g_aton_perf_diag && g_aton_perf_runs++ == 0)
    {
      /* This run carried the trajectory dump and the per-run reports.  From
       * the next one on they are suppressed, so what the application prints is
       * the inference itself - that is the number the performance work needs.
       */

      g_aton_perf_diag = false;
      aton_model_set_verbose(false);
      stm32n6_aton_wd_puts("[perf] per-run diagnostics off from the next run"
                           "\r\n");
    }

  if (ret < 0)
    {
      aton_model_dump_log();
      stm32n6_aton_rif_fault_dump();
    }

  params->result = ret;
  params->usec   = m->last_usec;
  params->runs   = m->runs;
  params->events = priv->events;

  m->last_result = ret;

  nxmutex_unlock(&priv->lock);

  return ret;
}

/****************************************************************************
 * Name: stm32n6_aton_aie_get_output
 *
 * Description:
 *   Report the result of the last inference (AIE_CMD_GET_OUTPUT).  The output
 *   tensor itself stays in the NPU pool: the application reads it at the
 *   address returned by STM32N6_ATON_CMD_GET_STATUS.
 *
 ****************************************************************************/

static int stm32n6_aton_aie_get_output(FAR struct aie_lowerhalf_s *lower,
                                       FAR void *context, uintptr_t output)
{
  FAR struct stm32n6_aton_lowerhalf_s *priv =
    (FAR struct stm32n6_aton_lowerhalf_s *)lower;
  FAR struct stm32n6_aton_invoke_params *params =
    (FAR struct stm32n6_aton_invoke_params *)(uintptr_t)output;
  FAR struct stm32n6_aton_model_s *m;
  int id;

  UNUSED(context);

  if (params == NULL)
    {
      return -EINVAL;
    }

  id = (int)params->model_id;

  if (id < 0 || id >= ATON_MODEL_NMODELS)
    {
      return -ENODEV;
    }

  m = &priv->model[id];

  params->result = m->last_result;
  params->usec   = m->last_usec;
  params->runs   = m->runs;
  params->events = priv->events;

  return m->last_result;
}

/****************************************************************************
 * Name: stm32n6_aton_aie_control
 *
 * Description:
 *   Driver specific commands: tensor sizes and the address of the output
 *   inside the NPU pool (STM32N6_ATON_CMD_GET_STATUS), and a raw string
 *   channel that does not depend on the console driver
 *   (STM32N6_ATON_CMD_PUTS).
 *
 ****************************************************************************/

static int stm32n6_aton_aie_control(FAR struct aie_lowerhalf_s *lower,
                                    FAR void *context, int cmd,
                                    unsigned long arg)
{
  FAR struct stm32n6_aton_lowerhalf_s *priv =
    (FAR struct stm32n6_aton_lowerhalf_s *)lower;
  FAR struct stm32n6_aton_model_s *m;
  int ret = -ENOSYS;

  UNUSED(context);

  switch (cmd)
    {
      case STM32N6_ATON_CMD_GET_STATUS:
        {
          FAR struct stm32n6_aton_status_s *status =
            (FAR struct stm32n6_aton_status_s *)arg;
          int id;

          if (status == NULL)
            {
              return -EINVAL;
            }

          /* model_id is an input field here, so it has to be read before the
           * rest of the block is cleared.
           */

          id = (int)status->model_id;

          if (id < 0 || id >= ATON_MODEL_NMODELS)
            {
              return -ENODEV;
            }

          m = &priv->model[id];

          memset(status, 0, sizeof(struct stm32n6_aton_status_s));

          status->model_id    = (uint32_t)id;
          status->name        = aton_model_name(id);

          /* The epoch program resolved its input address once, when it was
           * published; this is the only buffer whose content reaches the
           * engines, so hand it to the application instead of letting it
           * guess (a wrong buffer produces a result that never changes).
           */

          status->input_addr  = m->input_addr;
          status->input_size  = m->input_size;
          status->output_addr = m->output_addr;
          status->output_size = m->output_size;
          status->runs        = m->runs;
          status->last_usec   = m->last_usec;
          status->events      = priv->events;
          status->last_result = m->last_result;

          ret = OK;
        }
        break;

      case STM32N6_ATON_CMD_PUTS:
        {
          FAR const char *str = (FAR const char *)(uintptr_t)arg;

          if (str == NULL)
            {
              return -EINVAL;
            }

          /* Polled output: this exists so a diagnostic can be printed even
           * when the console driver (and its TX semaphore) is what stalled.
           */

          while (*str != '\0')
            {
              up_putc((int)(unsigned char)*str++);
            }

          ret = OK;
        }
        break;

      default:
        break;
    }

  return ret;
}

/****************************************************************************
 * Name: stm32n6_aton_readiness_probe
 *
 * Description:
 *   Print what the NPU hard blocks say about themselves (their VERSION
 *   registers) and whether the NPU cache RAM is enabled.  These are the
 *   values that make "the device is there but refuses to work" visible: a
 *   block version of zero means the block is not clocked, not released from
 *   reset, or not reachable at all.
 *
 ****************************************************************************/

static void stm32n6_aton_readiness_probe(void)
{
  uint32_t clkctrl = getreg32(STM32_ATON_BLK_CLKCTRL + 0x04);
  uint32_t busif   = getreg32(STM32_ATON_BLK_BUSIF0 + 0x04);
  uint32_t intctrl = getreg32(STM32_ATON_BLK_INTCTRL + 0x04);
  uint32_t streng  = getreg32(STM32_ATON_BLK_STRENG + 0x04);
  uint32_t convacc = getreg32(STM32_ATON_BLK_CONVACC + 0x04);
  uint32_t decun   = getreg32(STM32_ATON_BLK_DECUN + 0x04);
  uint32_t activ   = getreg32(STM32_ATON_BLK_ACTIV + 0x04);
  uint32_t arith   = getreg32(STM32_ATON_BLK_ARITH + 0x04);
  uint32_t pool    = getreg32(STM32_ATON_BLK_POOL + 0x04);

  _info("ATON blocks: clkctrl=0x%08lx busif=0x%08lx intctrl=0x%08lx "
        "streng=0x%08lx convacc=0x%08lx decun=0x%08lx activ=0x%08lx "
        "arith=0x%08lx pool=0x%08lx\n", (unsigned long)clkctrl,
        (unsigned long)busif, (unsigned long)intctrl, (unsigned long)streng,
        (unsigned long)convacc, (unsigned long)decun, (unsigned long)activ,
        (unsigned long)arith, (unsigned long)pool);

