open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_aton_aie.c
  _info("ATON npu cache: enabled=%d sr=0x%08lx\n",
        stm32n6_cacheaxi_is_enabled() ? 1 : 0,
        (unsigned long)stm32n6_cacheaxi_status());
}

/****************************************************************************
 * Name: stm32n6_aton_runtime_selftest
 *
 * Description:
 *   Bring the ST Edge AI runtime up and report the versions it was built
 *   from.  This runs once, from the driver's initialisation, so a mismatched
 *   runtime (or a runtime that refuses to start) is reported before the first
 *   inference is attempted.
 *
 ****************************************************************************/

static int stm32n6_aton_runtime_selftest(void)
{
  stai_runtime_info info;
  stai_return_code  status;

  stm32n6_aton_readiness_probe();

  status = stai_runtime_init();
  if (status != STAI_SUCCESS)
    {
      _err("ATON: stai_runtime_init() failed: 0x%06lx\n",
           (unsigned long)status);
      return -EIO;
    }

  memset(&info, 0, sizeof(info));

  status = stai_runtime_get_info(&info);
  if (status != STAI_SUCCESS)
    {
      _err("ATON: stai_runtime_get_info() failed: 0x%06lx\n",
           (unsigned long)status);
      return -EIO;
    }

  _info("ATON runtime up: api %u.%u.%u runtime %u.%u.%u tools %u.%u.%u "
        "build 0x%08lx compiler %s\n", info.api_version.major,
        info.api_version.minor, info.api_version.micro,
        info.runtime_version.major, info.runtime_version.minor,
        info.runtime_version.micro, info.tools_version.major,
        info.tools_version.minor, info.tools_version.micro,
        (unsigned long)info.runtime_build, info.compiler_desc);

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32n6_aton_aie_initialize
 *
 * Description:
 *   Bring the ATON accelerator to a state where a session can be started:
 *   release the NPU (and its cache RAM) from reset, open the RIF windows it
 *   needs, give it a coherent view of the non-secure memory, install the
 *   interrupt lines and register the character device.
 *
 *   The order matters and is not the one the reference manual suggests:
 *   the interrupt lines are attached before the driver is registered, so the
 *   NPU can never raise an interrupt into an unhandled vector, and the secure
 *   attributes of the NPU master (RIMC_ATTR1) are set before the first epoch
 *   program is published.
 *
 ****************************************************************************/


/****************************************************************************
 * Name: stm32n6_aton_ic6_boost
 *
 * Description:
 *   r76 experiment: raise IC6 -- the SYSCLK "domain B" divider that feeds
 *   the NPU -- from the FSBL's PLL1/4 = 300 MHz to PLL1/2 = 600 MHz.
 *
 *   Evidence: ST's own 995_AI_Hand_Landmarks application reconfigures IC6
 *   right before it enables the NPU clock (Appli/Core/Src/main.c:
 *   IC6SEL = PLL2, IC6DIV = 1 => 1000 MHz, then
 *   __HAL_RCC_NPU_CLK_ENABLE()), i.e. the NPU hangs off IC6.  The
 *   ALIENTEK FSBL chain-loads NuttX with PLL2 off and IC6 = PLL1/4 =
 *   300 MHz, so the NPU would run at roughly a third of ST's clock.
 *
 *   Only the INT divider field changes; PLL1 is already running at
 *   1200 MHz (FSBL M=4 / N=75), so no PLL is started or stopped.  This is
 *   deliberately a single-variable experiment: if the epoch cycle count
 *   does not drop, the NPU is not clocked by IC6.
 *
 *   IC6 feeds SYSCLK "domain B" only.  SYSCLK itself comes from IC2
 *   (PLL1/3 = 400 MHz) and every kernel clock in use on this board is
 *   routed elsewhere (USART1 = HSI, XSPI2 = IC3, SDMMC = IC4, LTDC =
 *   IC16, DCMIPP = IC17, CSI = IC18), so console/NOR/display are not
 *   affected.
 *
 *   The divider must not be changed while it is enabled: clear DIVEN,
 *   write the new ratio, then re-enable.  This port defines no DIVENCR
 *   alias, so DIVEN is cleared with a read-modify-write on DIVENR.
 *
 ****************************************************************************/

/* r78: back to the measured optimum.  r76 (IC6 = PLL1/2 = 600 MHz) took the
 * epoch loop from 259.8 M to 146.1 M cycles; r77 (IC6 = PLL2/1, nominally
 * 1000 MHz) configured *correctly* -- PLL2CFGR1 read back as M=8/N=125,
 * PLL2RDY = 1, IC6CFGR = 0x10000000 -- yet measured 194.4 M, which the
 * A/f + B model (A = 68262 Mcycle*MHz, B = 32.3 Mcycle, fitted from the
 * 300/600 MHz points) converts to an *effective* 421 MHz.
 *
 * Crossing the NPU domain to a second PLL therefore costs more than the
 * frequency buys back, so IC6 stays on PLL1 -- the same source as IC2/SYSCLK.
 * (The three fill checksums are identical across r76 and r77, so neither
 * configuration perturbs the arithmetic; only the speed differs.)
 *
 * To retry 1200 MHz on the same PLL -- above the NPU's 1 GHz rating, an
 * experiment only -- set STM32N6_ATON_IC6_DIV to 1 and rebuild.
 */

#define STM32N6_ATON_IC6_DIV 2 /* PLL1 / 2 = 600 MHz (measured optimum) */

static void stm32n6_aton_ic6_boost(void)
{
  uint32_t before = getreg32(STM32_RCC_IC6CFGR);
  uint32_t denr   = getreg32(STM32_RCC_DIVENR);

  modifyreg32(STM32_RCC_DIVENR, RCC_DIVENR_IC6EN, 0);
  putreg32(RCC_ICCFGR_SEL_PLL1 |
           ((STM32N6_ATON_IC6_DIV - 1) << RCC_ICCFGR_INT_SHIFT),
           STM32_RCC_IC6CFGR);
  putreg32(RCC_DIVENR_IC6EN, STM32_RCC_DIVENSR);

  _info("IC6CFGR %08lx -> %08lx (PLL1/4 = 300 MHz -> PLL1/%u = 600 MHz)\n",
        (unsigned long)before, (unsigned long)getreg32(STM32_RCC_IC6CFGR),
        (unsigned)STM32N6_ATON_IC6_DIV);
  _info("DIVENR %08lx -> %08lx (IC6EN bit %lu)\n",
        (unsigned long)denr, (unsigned long)getreg32(STM32_RCC_DIVENR),
        (unsigned long)((getreg32(STM32_RCC_DIVENR) >> 5) & 1u));
}

int stm32n6_aton_aie_initialize(void)
{
  FAR struct stm32n6_aton_lowerhalf_s *priv;
  int ret;
  int i;

  stm32n6_aton_wd_puts("[aton] diag build r78 (IC6 back on PLL1/2 = 600 MHz: "
                       "PLL2/1 was configured correctly but measured 1.33x "
                       "SLOWER, so the NPU domain stays on PLL1)\r\n");

  priv = (FAR struct stm32n6_aton_lowerhalf_s *)
         zalloc(sizeof(struct stm32n6_aton_lowerhalf_s));
  if (priv == NULL)
    {
      _err("ERROR: Failed to allocate STM32N6 ATON lower-half\n");
      return -ENOMEM;
    }

  priv->lower.ops = &g_stm32n6_aton_aie_ops;
  nxmutex_init(&priv->lock);

