open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_aton_aie.c
  /* r76: raise the NPU clock-domain divider before the NPU gate opens.
   * See stm32n6_aton_ic6_boost() for the evidence and the risk analysis.
   */

  stm32n6_aton_ic6_boost();

  /* Clock the NPU and its cache RAM, then pulse their resets: the RM lists
   * the reset as the last step of the sequence, and the blocks come up with
   * a zero VERSION register when only the clock (or only the reset) is done.
   */

  modifyreg32(STM32_RCC_AHB5ENR, 0, RCC_AHB5ENR_NPUEN);
  modifyreg32(STM32_RCC_AHB5RSTR, 0, RCC_AHB5RSTR_NPURST);
  modifyreg32(STM32_RCC_AHB5RSTR, RCC_AHB5RSTR_NPURST, 0);

  modifyreg32(STM32_RCC_AHB5ENR, 0, RCC_AHB5ENR_CACHEAXIEN);
  modifyreg32(STM32_RCC_AHB5RSTR, 0, RCC_AHB5RSTR_CACHEAXIRST);
  modifyreg32(STM32_RCC_AHB5RSTR, RCC_AHB5RSTR_CACHEAXIRST, 0);

  /* Open the windows the NPU needs, before the CPU tries to touch any of the
   * memory it shares with the accelerator.
   */

  stm32n6_aton_risaf_clear();
  stm32n6_aton_risaf_map_dump("before");

  stm32n6_aton_ns_setup();

  stm32n6_aton_risaf_nor_open();
  stm32n6_aton_risaf_map_dump("after");

  /* The NPU cache RAM is not a cache in the CPU sense: it is a scratchpad the
   * runtime uses for its tensor accesses, and it has to be initialized and
   * enabled before any inference.
   */

  npu_cache_init();
  npu_cache_enable();

  /* RIMC_ATTR1: the ATON master attributes (maskable security attribute
   * register).  0x310 is MSEC (bit 8) | MPRIV (bit 9) | MCID 1 (bits 6:4),
   * i.e. "secure, privileged, CID 1" - the default domain of every RIF window
   * this driver opens, and the only one that may read the weights in the NOR
   * flash.
   */

  putreg32(0x00000310u, STM32N6_ATON_RIMC_ATTR1); /* NB: value first */

  stm32n6_aton_wd_puts("[rimc] npu attr=");
  stm32n6_aton_wd_hex(getreg32(STM32N6_ATON_RIMC_ATTR1));
  stm32n6_aton_wd_puts(" (want CID=1 secure priv)\r\n");

  /* Attach and enable the four NPU interrupt lines.  The driver's handler
   * stays installed until the runtime installs its own for line 0; keeping
   * the lines enabled from here on means a stray NPU interrupt is counted
   * rather than reported as an unexpected interrupt.
   */

  for (i = 0; i < (int)STM32N6_ATON_NIRQS; i++)
    {
      ret = irq_attach(g_stm32n6_aton_npu_irqs[i], stm32n6_aton_npu_irq,
                       priv);
      if (ret < 0)
        {
          _err("ERROR: Failed to attach NPU IRQ %d: %d\n",
               g_stm32n6_aton_npu_irqs[i], ret);

          while (i > 0)
            {
              i--;
              up_disable_irq(g_stm32n6_aton_npu_irqs[i]);
              irq_attach(g_stm32n6_aton_npu_irqs[i], NULL, NULL);
            }

          nxmutex_destroy(&priv->lock);
          free(priv);
          return ret;
        }

      up_enable_irq(g_stm32n6_aton_npu_irqs[i]);
    }

  ret = aie_register(CONFIG_STM32N6_ATON_AIE_DEVPATH, &priv->lower);
  if (ret < 0)
    {
      _err("ERROR: Failed to register STM32N6 ATON AIE driver: %d\n", ret);

      for (i = 0; i < (int)STM32N6_ATON_NIRQS; i++)
        {
          up_disable_irq(g_stm32n6_aton_npu_irqs[i]);
          irq_attach(g_stm32n6_aton_npu_irqs[i], NULL, NULL);
        }

      nxmutex_destroy(&priv->lock);
      free(priv);
      return ret;
    }

  _info("STM32N6 ATON AIE driver registered at %s\n",
        CONFIG_STM32N6_ATON_AIE_DEVPATH);

  /* Report the state of the accelerator the application is about to use:
   * block versions, the NPU cache and the runtime versions.
   */

  stm32n6_aton_runtime_selftest();

  return OK;
}
